espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_c_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SPI_MEM_C_CMD_REG register
 *  SPI0 FSM status register
 */
#define SPI_MEM_C_CMD_REG (DR_REG_FLASH_SPI0_BASE + 0x0)
/** SPI_MEM_C_MST_ST : RO; bitpos: [3:0]; default: 0;
 *  The current status of SPI0 master FSM: spi0_mst_st. 0: idle state, 1:SPI0_GRANT ,
 *  2: program/erase suspend state, 3: SPI0 read data state, 4: wait cache/EDMA sent
 *  data is stored in SPI0 TX FIFO, 5: SPI0 write data state.
 */
#define SPI_MEM_C_MST_ST    0x0000000FU
#define SPI_MEM_C_MST_ST_M  (SPI_MEM_C_MST_ST_V << SPI_MEM_C_MST_ST_S)
#define SPI_MEM_C_MST_ST_V  0x0000000FU
#define SPI_MEM_C_MST_ST_S  0
/** SPI_MEM_C_SLV_ST : RO; bitpos: [7:4]; default: 0;
 *  The current status of SPI0 slave FSM: mspi_st. 0: idle state, 1: preparation state,
 *  2: send command state, 3: send address state, 4: wait state, 5: read data state,
 *  6:write data state, 7: done state, 8: read data end state.
 */
#define SPI_MEM_C_SLV_ST    0x0000000FU
#define SPI_MEM_C_SLV_ST_M  (SPI_MEM_C_SLV_ST_V << SPI_MEM_C_SLV_ST_S)
#define SPI_MEM_C_SLV_ST_V  0x0000000FU
#define SPI_MEM_C_SLV_ST_S  4
/** SPI_MEM_C_USR : HRO; bitpos: [18]; default: 0;
 *  SPI0 USR_CMD start bit, only used when SPI_MEM_C_AXI_REQ_EN is cleared.  An
 *  operation will be triggered when the bit is set. The bit will be cleared once the
 *  operation done.1: enable 0: disable.
 */
#define SPI_MEM_C_USR    (BIT(18))
#define SPI_MEM_C_USR_M  (SPI_MEM_C_USR_V << SPI_MEM_C_USR_S)
#define SPI_MEM_C_USR_V  0x00000001U
#define SPI_MEM_C_USR_S  18

/** SPI_MEM_C_CTRL_REG register
 *  SPI0 control register.
 */
#define SPI_MEM_C_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x8)
/** SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT : HRO; bitpos: [0]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to flash, the level
 *  of SPI_DQS is output by the MSPI controller.
 */
#define SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT    (BIT(0))
#define SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT_M  (SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT_V << SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT_S)
#define SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT_V  0x00000001U
#define SPI_MEM_C_WDUMMY_DQS_ALWAYS_OUT_S  0
/** SPI_MEM_C_WDUMMY_ALWAYS_OUT : R/W; bitpos: [1]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to flash, the level
 *  of SPI_IO[7:0] is output by the MSPI controller.
 */
#define SPI_MEM_C_WDUMMY_ALWAYS_OUT    (BIT(1))
#define SPI_MEM_C_WDUMMY_ALWAYS_OUT_M  (SPI_MEM_C_WDUMMY_ALWAYS_OUT_V << SPI_MEM_C_WDUMMY_ALWAYS_OUT_S)
#define SPI_MEM_C_WDUMMY_ALWAYS_OUT_V  0x00000001U
#define SPI_MEM_C_WDUMMY_ALWAYS_OUT_S  1
/** SPI_MEM_C_FDUMMY_RIN : R/W; bitpos: [2]; default: 1;
 *  In an MSPI read data transfer when accesses to flash, the level of SPI_IO[7:0] is
 *  output by the MSPI controller in the first half part of dummy phase. It is used to
 *  mask invalid SPI_DQS in the half part of dummy phase.
 */
#define SPI_MEM_C_FDUMMY_RIN    (BIT(2))
#define SPI_MEM_C_FDUMMY_RIN_M  (SPI_MEM_C_FDUMMY_RIN_V << SPI_MEM_C_FDUMMY_RIN_S)
#define SPI_MEM_C_FDUMMY_RIN_V  0x00000001U
#define SPI_MEM_C_FDUMMY_RIN_S  2
/** SPI_MEM_C_FDUMMY_WOUT : R/W; bitpos: [3]; default: 1;
 *  In an MSPI write data transfer when accesses to flash, the level of SPI_IO[7:0] is
 *  output by the MSPI controller in the second half part of dummy phase. It is used to
 *  pre-drive flash.
 */
#define SPI_MEM_C_FDUMMY_WOUT    (BIT(3))
#define SPI_MEM_C_FDUMMY_WOUT_M  (SPI_MEM_C_FDUMMY_WOUT_V << SPI_MEM_C_FDUMMY_WOUT_S)
#define SPI_MEM_C_FDUMMY_WOUT_V  0x00000001U
#define SPI_MEM_C_FDUMMY_WOUT_S  3
/** SPI_MEM_C_FDOUT_OCT : HRO; bitpos: [4]; default: 0;
 *  Apply 8 signals during write-data phase 1:enable 0: disable
 */
#define SPI_MEM_C_FDOUT_OCT    (BIT(4))
#define SPI_MEM_C_FDOUT_OCT_M  (SPI_MEM_C_FDOUT_OCT_V << SPI_MEM_C_FDOUT_OCT_S)
#define SPI_MEM_C_FDOUT_OCT_V  0x00000001U
#define SPI_MEM_C_FDOUT_OCT_S  4
/** SPI_MEM_C_FDIN_OCT : HRO; bitpos: [5]; default: 0;
 *  Apply 8 signals during read-data phase 1:enable 0: disable
 */
#define SPI_MEM_C_FDIN_OCT    (BIT(5))
#define SPI_MEM_C_FDIN_OCT_M  (SPI_MEM_C_FDIN_OCT_V << SPI_MEM_C_FDIN_OCT_S)
#define SPI_MEM_C_FDIN_OCT_V  0x00000001U
#define SPI_MEM_C_FDIN_OCT_S  5
/** SPI_MEM_C_FADDR_OCT : HRO; bitpos: [6]; default: 0;
 *  Apply 8 signals during address phase 1:enable 0: disable
 */
#define SPI_MEM_C_FADDR_OCT    (BIT(6))
#define SPI_MEM_C_FADDR_OCT_M  (SPI_MEM_C_FADDR_OCT_V << SPI_MEM_C_FADDR_OCT_S)
#define SPI_MEM_C_FADDR_OCT_V  0x00000001U
#define SPI_MEM_C_FADDR_OCT_S  6
/** SPI_MEM_C_FCMD_QUAD : R/W; bitpos: [8]; default: 0;
 *  Apply 4 signals during command phase 1:enable 0: disable
 */
#define SPI_MEM_C_FCMD_QUAD    (BIT(8))
#define SPI_MEM_C_FCMD_QUAD_M  (SPI_MEM_C_FCMD_QUAD_V << SPI_MEM_C_FCMD_QUAD_S)
#define SPI_MEM_C_FCMD_QUAD_V  0x00000001U
#define SPI_MEM_C_FCMD_QUAD_S  8
/** SPI_MEM_C_FCMD_OCT : HRO; bitpos: [9]; default: 0;
 *  Apply 8 signals during command phase 1:enable 0: disable
 */
#define SPI_MEM_C_FCMD_OCT    (BIT(9))
#define SPI_MEM_C_FCMD_OCT_M  (SPI_MEM_C_FCMD_OCT_V << SPI_MEM_C_FCMD_OCT_S)
#define SPI_MEM_C_FCMD_OCT_V  0x00000001U
#define SPI_MEM_C_FCMD_OCT_S  9
/** SPI_MEM_C_FASTRD_MODE : R/W; bitpos: [13]; default: 1;
 *  This bit enable the bits: SPI_MEM_C_FREAD_QIO, SPI_MEM_C_FREAD_DIO,
 *  SPI_MEM_C_FREAD_QOUT and SPI_MEM_C_FREAD_DOUT. 1: enable 0: disable.
 */
#define SPI_MEM_C_FASTRD_MODE    (BIT(13))
#define SPI_MEM_C_FASTRD_MODE_M  (SPI_MEM_C_FASTRD_MODE_V << SPI_MEM_C_FASTRD_MODE_S)
#define SPI_MEM_C_FASTRD_MODE_V  0x00000001U
#define SPI_MEM_C_FASTRD_MODE_S  13
/** SPI_MEM_C_FREAD_DUAL : R/W; bitpos: [14]; default: 0;
 *  In the read operations, read-data phase apply 2 signals. 1: enable 0: disable.
 */
#define SPI_MEM_C_FREAD_DUAL    (BIT(14))
#define SPI_MEM_C_FREAD_DUAL_M  (SPI_MEM_C_FREAD_DUAL_V << SPI_MEM_C_FREAD_DUAL_S)
#define SPI_MEM_C_FREAD_DUAL_V  0x00000001U
#define SPI_MEM_C_FREAD_DUAL_S  14
/** SPI_MEM_C_Q_POL : R/W; bitpos: [18]; default: 1;
 *  The bit is used to set MISO line polarity, 1: high 0, low
 */
#define SPI_MEM_C_Q_POL    (BIT(18))
#define SPI_MEM_C_Q_POL_M  (SPI_MEM_C_Q_POL_V << SPI_MEM_C_Q_POL_S)
#define SPI_MEM_C_Q_POL_V  0x00000001U
#define SPI_MEM_C_Q_POL_S  18
/** SPI_MEM_C_D_POL : R/W; bitpos: [19]; default: 1;
 *  The bit is used to set MOSI line polarity, 1: high 0, low
 */
#define SPI_MEM_C_D_POL    (BIT(19))
#define SPI_MEM_C_D_POL_M  (SPI_MEM_C_D_POL_V << SPI_MEM_C_D_POL_S)
#define SPI_MEM_C_D_POL_V  0x00000001U
#define SPI_MEM_C_D_POL_S  19
/** SPI_MEM_C_FREAD_QUAD : R/W; bitpos: [20]; default: 0;
 *  In the read operations read-data phase apply 4 signals. 1: enable 0: disable.
 */
#define SPI_MEM_C_FREAD_QUAD    (BIT(20))
#define SPI_MEM_C_FREAD_QUAD_M  (SPI_MEM_C_FREAD_QUAD_V << SPI_MEM_C_FREAD_QUAD_S)
#define SPI_MEM_C_FREAD_QUAD_V  0x00000001U
#define SPI_MEM_C_FREAD_QUAD_S  20
/** SPI_MEM_C_WP_REG : R/W; bitpos: [21]; default: 1;
 *  Write protect signal output when SPI is idle.  1: output high, 0: output low.
 */
#define SPI_MEM_C_WP_REG    (BIT(21))
#define SPI_MEM_C_WP_REG_M  (SPI_MEM_C_WP_REG_V << SPI_MEM_C_WP_REG_S)
#define SPI_MEM_C_WP_REG_V  0x00000001U
#define SPI_MEM_C_WP_REG_S  21
/** SPI_MEM_C_FREAD_DIO : R/W; bitpos: [23]; default: 0;
 *  In the read operations address phase and read-data phase apply 2 signals. 1: enable
 *  0: disable.
 */
#define SPI_MEM_C_FREAD_DIO    (BIT(23))
#define SPI_MEM_C_FREAD_DIO_M  (SPI_MEM_C_FREAD_DIO_V << SPI_MEM_C_FREAD_DIO_S)
#define SPI_MEM_C_FREAD_DIO_V  0x00000001U
#define SPI_MEM_C_FREAD_DIO_S  23
/** SPI_MEM_C_FREAD_QIO : R/W; bitpos: [24]; default: 0;
 *  In the read operations address phase and read-data phase apply 4 signals. 1: enable
 *  0: disable.
 */
#define SPI_MEM_C_FREAD_QIO    (BIT(24))
#define SPI_MEM_C_FREAD_QIO_M  (SPI_MEM_C_FREAD_QIO_V << SPI_MEM_C_FREAD_QIO_S)
#define SPI_MEM_C_FREAD_QIO_V  0x00000001U
#define SPI_MEM_C_FREAD_QIO_S  24
/** SPI_MEM_C_DQS_IE_ALWAYS_ON : HRO; bitpos: [30]; default: 0;
 *  When accesses to flash, 1: the IE signals of pads connected to SPI_DQS are always
 *  1. 0: Others.
 */
#define SPI_MEM_C_DQS_IE_ALWAYS_ON    (BIT(30))
#define SPI_MEM_C_DQS_IE_ALWAYS_ON_M  (SPI_MEM_C_DQS_IE_ALWAYS_ON_V << SPI_MEM_C_DQS_IE_ALWAYS_ON_S)
#define SPI_MEM_C_DQS_IE_ALWAYS_ON_V  0x00000001U
#define SPI_MEM_C_DQS_IE_ALWAYS_ON_S  30
/** SPI_MEM_C_DATA_IE_ALWAYS_ON : R/W; bitpos: [31]; default: 1;
 *  When accesses to flash, 1: the IE signals of pads connected to SPI_IO[7:0] are
 *  always 1. 0: Others.
 */
#define SPI_MEM_C_DATA_IE_ALWAYS_ON    (BIT(31))
#define SPI_MEM_C_DATA_IE_ALWAYS_ON_M  (SPI_MEM_C_DATA_IE_ALWAYS_ON_V << SPI_MEM_C_DATA_IE_ALWAYS_ON_S)
#define SPI_MEM_C_DATA_IE_ALWAYS_ON_V  0x00000001U
#define SPI_MEM_C_DATA_IE_ALWAYS_ON_S  31

/** SPI_MEM_C_CTRL1_REG register
 *  SPI0 control1 register.
 */
#define SPI_MEM_C_CTRL1_REG (DR_REG_FLASH_SPI0_BASE + 0xc)
/** SPI_MEM_C_CLK_MODE : R/W; bitpos: [1:0]; default: 0;
 *  SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed
 *  one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3:
 *  SPI clock is always on.
 */
#define SPI_MEM_C_CLK_MODE    0x00000003U
#define SPI_MEM_C_CLK_MODE_M  (SPI_MEM_C_CLK_MODE_V << SPI_MEM_C_CLK_MODE_S)
#define SPI_MEM_C_CLK_MODE_V  0x00000003U
#define SPI_MEM_C_CLK_MODE_S  0
/** SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN : R/W; bitpos: [21]; default: 1;
 *  1: MSPI supports ARSIZE 0~3. When ARSIZE =0~2, MSPI read address is 4*n and reply
 *  the real AXI read data back. 0: When ARSIZE 0~1, MSPI reply SLV_ERR.
 */
#define SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN    (BIT(21))
#define SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN_M  (SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN_V << SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN_S)
#define SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN_V  0x00000001U
#define SPI_MEM_C_AR_SIZE0_1_SUPPORT_EN_S  21
/** SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN : R/W; bitpos: [22]; default: 1;
 *  1: MSPI supports AWSIZE 0~3. 0: When AWSIZE 0~1, MSPI reply SLV_ERR.
 */
#define SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN    (BIT(22))
#define SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN_M  (SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN_V << SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN_S)
#define SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN_V  0x00000001U
#define SPI_MEM_C_AW_SIZE0_1_SUPPORT_EN_S  22
/** SPI_MEM_C_RRESP_ECC_ERR_EN : R/W; bitpos: [24]; default: 0;
 *  1: RRESP is SLV_ERR when there is a ECC error in AXI read data. 0: RRESP is OKAY
 *  when there is a ECC error in AXI read data. The ECC error information is recorded
 *  in SPI_MEM_C_ECC_ERR_ADDR_REG.
 */
#define SPI_MEM_C_RRESP_ECC_ERR_EN    (BIT(24))
#define SPI_MEM_C_RRESP_ECC_ERR_EN_M  (SPI_MEM_C_RRESP_ECC_ERR_EN_V << SPI_MEM_C_RRESP_ECC_ERR_EN_S)
#define SPI_MEM_C_RRESP_ECC_ERR_EN_V  0x00000001U
#define SPI_MEM_C_RRESP_ECC_ERR_EN_S  24
/** SPI_MEM_C_AR_SPLICE_EN : HRO; bitpos: [25]; default: 0;
 *  Set this bit to enable AXI Read Splice-transfer.
 */
#define SPI_MEM_C_AR_SPLICE_EN    (BIT(25))
#define SPI_MEM_C_AR_SPLICE_EN_M  (SPI_MEM_C_AR_SPLICE_EN_V << SPI_MEM_C_AR_SPLICE_EN_S)
#define SPI_MEM_C_AR_SPLICE_EN_V  0x00000001U
#define SPI_MEM_C_AR_SPLICE_EN_S  25
/** SPI_MEM_C_AW_SPLICE_EN : HRO; bitpos: [26]; default: 0;
 *  Set this bit to enable AXI Write Splice-transfer.
 */
#define SPI_MEM_C_AW_SPLICE_EN    (BIT(26))
#define SPI_MEM_C_AW_SPLICE_EN_M  (SPI_MEM_C_AW_SPLICE_EN_V << SPI_MEM_C_AW_SPLICE_EN_S)
#define SPI_MEM_C_AW_SPLICE_EN_V  0x00000001U
#define SPI_MEM_C_AW_SPLICE_EN_S  26
/** SPI_MEM_C_RAM0_EN : HRO; bitpos: [27]; default: 1;
 *  When SPI_MEM_C_DUAL_RAM_EN is 0 and SPI_MEM_C_RAM0_EN is 1, only EXT_RAM0 will be
 *  accessed. When SPI_MEM_C_DUAL_RAM_EN is 0 and SPI_MEM_C_RAM0_EN is 0, only EXT_RAM1
 *  will be accessed. When SPI_MEM_C_DUAL_RAM_EN is 1,  EXT_RAM0 and EXT_RAM1 will be
 *  accessed at the same time.
 */
#define SPI_MEM_C_RAM0_EN    (BIT(27))
#define SPI_MEM_C_RAM0_EN_M  (SPI_MEM_C_RAM0_EN_V << SPI_MEM_C_RAM0_EN_S)
#define SPI_MEM_C_RAM0_EN_V  0x00000001U
#define SPI_MEM_C_RAM0_EN_S  27
/** SPI_MEM_C_DUAL_RAM_EN : HRO; bitpos: [28]; default: 0;
 *  Set this bit to enable DUAL-RAM mode, EXT_RAM0 and EXT_RAM1 will be accessed at the
 *  same time.
 */
#define SPI_MEM_C_DUAL_RAM_EN    (BIT(28))
#define SPI_MEM_C_DUAL_RAM_EN_M  (SPI_MEM_C_DUAL_RAM_EN_V << SPI_MEM_C_DUAL_RAM_EN_S)
#define SPI_MEM_C_DUAL_RAM_EN_V  0x00000001U
#define SPI_MEM_C_DUAL_RAM_EN_S  28
/** SPI_MEM_C_FAST_WRITE_EN : R/W; bitpos: [29]; default: 1;
 *  Set this bit to write data faster, do not wait write data has been stored in
 *  tx_bus_fifo_l2. It will wait 4*T_clk_ctrl to insure the write data has been stored
 *  in  tx_bus_fifo_l2.
 */
#define SPI_MEM_C_FAST_WRITE_EN    (BIT(29))
#define SPI_MEM_C_FAST_WRITE_EN_M  (SPI_MEM_C_FAST_WRITE_EN_V << SPI_MEM_C_FAST_WRITE_EN_S)
#define SPI_MEM_C_FAST_WRITE_EN_V  0x00000001U
#define SPI_MEM_C_FAST_WRITE_EN_S  29
/** SPI_MEM_C_RXFIFO_RST : WT; bitpos: [30]; default: 0;
 *  The synchronous reset signal for SPI0 RX AFIFO and all the AES_MSPI SYNC FIFO to
 *  receive signals from AXI.  Set this bit to reset these FIFO.
 */
#define SPI_MEM_C_RXFIFO_RST    (BIT(30))
#define SPI_MEM_C_RXFIFO_RST_M  (SPI_MEM_C_RXFIFO_RST_V << SPI_MEM_C_RXFIFO_RST_S)
#define SPI_MEM_C_RXFIFO_RST_V  0x00000001U
#define SPI_MEM_C_RXFIFO_RST_S  30
/** SPI_MEM_C_TXFIFO_RST : WT; bitpos: [31]; default: 0;
 *  The synchronous reset signal for SPI0 TX AFIFO and all the AES_MSPI SYNC FIFO to
 *  send signals to AXI. Set this bit to reset these FIFO.
 */
#define SPI_MEM_C_TXFIFO_RST    (BIT(31))
#define SPI_MEM_C_TXFIFO_RST_M  (SPI_MEM_C_TXFIFO_RST_V << SPI_MEM_C_TXFIFO_RST_S)
#define SPI_MEM_C_TXFIFO_RST_V  0x00000001U
#define SPI_MEM_C_TXFIFO_RST_S  31

/** SPI_MEM_C_CTRL2_REG register
 *  SPI0 control2 register.
 */
#define SPI_MEM_C_CTRL2_REG (DR_REG_FLASH_SPI0_BASE + 0x10)
/** SPI_MEM_C_CS_SETUP_TIME : R/W; bitpos: [4:0]; default: 1;
 *  (cycles-1) of prepare phase by SPI Bus clock, this bits are combined with
 *  SPI_MEM_C_CS_SETUP bit.
 */
#define SPI_MEM_C_CS_SETUP_TIME    0x0000001FU
#define SPI_MEM_C_CS_SETUP_TIME_M  (SPI_MEM_C_CS_SETUP_TIME_V << SPI_MEM_C_CS_SETUP_TIME_S)
#define SPI_MEM_C_CS_SETUP_TIME_V  0x0000001FU
#define SPI_MEM_C_CS_SETUP_TIME_S  0
/** SPI_MEM_C_CS_HOLD_TIME : R/W; bitpos: [9:5]; default: 1;
 *  SPI CS signal is delayed to inactive by SPI bus clock, this bits are combined with
 *  SPI_MEM_C_CS_HOLD bit.
 */
#define SPI_MEM_C_CS_HOLD_TIME    0x0000001FU
#define SPI_MEM_C_CS_HOLD_TIME_M  (SPI_MEM_C_CS_HOLD_TIME_V << SPI_MEM_C_CS_HOLD_TIME_S)
#define SPI_MEM_C_CS_HOLD_TIME_V  0x0000001FU
#define SPI_MEM_C_CS_HOLD_TIME_S  5
/** SPI_MEM_C_ECC_CS_HOLD_TIME : HRO; bitpos: [12:10]; default: 3;
 *  SPI_MEM_C_CS_HOLD_TIME + SPI_MEM_C_ECC_CS_HOLD_TIME is the SPI0 CS hold cycle in
 *  ECC mode when accessed flash.
 */
#define SPI_MEM_C_ECC_CS_HOLD_TIME    0x00000007U
#define SPI_MEM_C_ECC_CS_HOLD_TIME_M  (SPI_MEM_C_ECC_CS_HOLD_TIME_V << SPI_MEM_C_ECC_CS_HOLD_TIME_S)
#define SPI_MEM_C_ECC_CS_HOLD_TIME_V  0x00000007U
#define SPI_MEM_C_ECC_CS_HOLD_TIME_S  10
/** SPI_MEM_C_ECC_SKIP_PAGE_CORNER : HRO; bitpos: [13]; default: 1;
 *  1: SPI0 and SPI1 skip page corner when accesses flash. 0: Not skip page corner when
 *  accesses flash.
 */
#define SPI_MEM_C_ECC_SKIP_PAGE_CORNER    (BIT(13))
#define SPI_MEM_C_ECC_SKIP_PAGE_CORNER_M  (SPI_MEM_C_ECC_SKIP_PAGE_CORNER_V << SPI_MEM_C_ECC_SKIP_PAGE_CORNER_S)
#define SPI_MEM_C_ECC_SKIP_PAGE_CORNER_V  0x00000001U
#define SPI_MEM_C_ECC_SKIP_PAGE_CORNER_S  13
/** SPI_MEM_C_ECC_16TO18_BYTE_EN : HRO; bitpos: [14]; default: 0;
 *  Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode when
 *  accesses flash.
 */
#define SPI_MEM_C_ECC_16TO18_BYTE_EN    (BIT(14))
#define SPI_MEM_C_ECC_16TO18_BYTE_EN_M  (SPI_MEM_C_ECC_16TO18_BYTE_EN_V << SPI_MEM_C_ECC_16TO18_BYTE_EN_S)
#define SPI_MEM_C_ECC_16TO18_BYTE_EN_V  0x00000001U
#define SPI_MEM_C_ECC_16TO18_BYTE_EN_S  14
/** SPI_MEM_C_SPLIT_TRANS_EN : R/W; bitpos: [24]; default: 1;
 *  Set this bit to enable SPI0 split one AXI read flash transfer into two SPI
 *  transfers when one transfer will cross flash or EXT_RAM page corner, valid no
 *  matter whether there is an ECC region or not.
 */
#define SPI_MEM_C_SPLIT_TRANS_EN    (BIT(24))
#define SPI_MEM_C_SPLIT_TRANS_EN_M  (SPI_MEM_C_SPLIT_TRANS_EN_V << SPI_MEM_C_SPLIT_TRANS_EN_S)
#define SPI_MEM_C_SPLIT_TRANS_EN_V  0x00000001U
#define SPI_MEM_C_SPLIT_TRANS_EN_S  24
/** SPI_MEM_C_CS_HOLD_DELAY : R/W; bitpos: [30:25]; default: 0;
 *  These bits are used to set the minimum CS high time tSHSL between SPI burst
 *  transfer when accesses to flash. tSHSL is (SPI_MEM_C_CS_HOLD_DELAY[5:0] + 1) MSPI
 *  core clock cycles.
 */
#define SPI_MEM_C_CS_HOLD_DELAY    0x0000003FU
#define SPI_MEM_C_CS_HOLD_DELAY_M  (SPI_MEM_C_CS_HOLD_DELAY_V << SPI_MEM_C_CS_HOLD_DELAY_S)
#define SPI_MEM_C_CS_HOLD_DELAY_V  0x0000003FU
#define SPI_MEM_C_CS_HOLD_DELAY_S  25
/** SPI_MEM_C_SYNC_RESET : WT; bitpos: [31]; default: 0;
 *  The spi0_mst_st and spi0_slv_st will be reset.
 */
#define SPI_MEM_C_SYNC_RESET    (BIT(31))
#define SPI_MEM_C_SYNC_RESET_M  (SPI_MEM_C_SYNC_RESET_V << SPI_MEM_C_SYNC_RESET_S)
#define SPI_MEM_C_SYNC_RESET_V  0x00000001U
#define SPI_MEM_C_SYNC_RESET_S  31

/** SPI_MEM_C_CLOCK_REG register
 *  SPI clock division control register.
 */
#define SPI_MEM_C_CLOCK_REG (DR_REG_FLASH_SPI0_BASE + 0x14)
/** SPI_MEM_C_CLKCNT_L : R/W; bitpos: [7:0]; default: 3;
 *  In the master mode it must be equal to SPI_MEM_C_CLKCNT_N.
 */
#define SPI_MEM_C_CLKCNT_L    0x000000FFU
#define SPI_MEM_C_CLKCNT_L_M  (SPI_MEM_C_CLKCNT_L_V << SPI_MEM_C_CLKCNT_L_S)
#define SPI_MEM_C_CLKCNT_L_V  0x000000FFU
#define SPI_MEM_C_CLKCNT_L_S  0
/** SPI_MEM_C_CLKCNT_H : R/W; bitpos: [15:8]; default: 1;
 *  In the master mode it must be floor((SPI_MEM_C_CLKCNT_N+1)/2-1).
 */
#define SPI_MEM_C_CLKCNT_H    0x000000FFU
#define SPI_MEM_C_CLKCNT_H_M  (SPI_MEM_C_CLKCNT_H_V << SPI_MEM_C_CLKCNT_H_S)
#define SPI_MEM_C_CLKCNT_H_V  0x000000FFU
#define SPI_MEM_C_CLKCNT_H_S  8
/** SPI_MEM_C_CLKCNT_N : R/W; bitpos: [23:16]; default: 3;
 *  In the master mode it is the divider of spi_mem_clk. So spi_mem_clk frequency is
 *  system/(SPI_MEM_C_CLKCNT_N+1)
 */
#define SPI_MEM_C_CLKCNT_N    0x000000FFU
#define SPI_MEM_C_CLKCNT_N_M  (SPI_MEM_C_CLKCNT_N_V << SPI_MEM_C_CLKCNT_N_S)
#define SPI_MEM_C_CLKCNT_N_V  0x000000FFU
#define SPI_MEM_C_CLKCNT_N_S  16
/** SPI_MEM_C_CLK_EQU_SYSCLK : R/W; bitpos: [31]; default: 0;
 *  1: 1-division mode, the frequency of SPI bus clock equals to that of MSPI module
 *  clock.
 */
#define SPI_MEM_C_CLK_EQU_SYSCLK    (BIT(31))
#define SPI_MEM_C_CLK_EQU_SYSCLK_M  (SPI_MEM_C_CLK_EQU_SYSCLK_V << SPI_MEM_C_CLK_EQU_SYSCLK_S)
#define SPI_MEM_C_CLK_EQU_SYSCLK_V  0x00000001U
#define SPI_MEM_C_CLK_EQU_SYSCLK_S  31

