espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_c_reg.h
/** SPI_MEM_C_USER_REG register
 *  SPI0 user register.
 */
#define SPI_MEM_C_USER_REG (DR_REG_FLASH_SPI0_BASE + 0x18)
/** SPI_MEM_C_CS_HOLD : R/W; bitpos: [6]; default: 0;
 *  spi cs keep low when spi is in  done  phase. 1: enable 0: disable.
 */
#define SPI_MEM_C_CS_HOLD    (BIT(6))
#define SPI_MEM_C_CS_HOLD_M  (SPI_MEM_C_CS_HOLD_V << SPI_MEM_C_CS_HOLD_S)
#define SPI_MEM_C_CS_HOLD_V  0x00000001U
#define SPI_MEM_C_CS_HOLD_S  6
/** SPI_MEM_C_CS_SETUP : R/W; bitpos: [7]; default: 0;
 *  spi cs is enable when spi is in  prepare  phase. 1: enable 0: disable.
 */
#define SPI_MEM_C_CS_SETUP    (BIT(7))
#define SPI_MEM_C_CS_SETUP_M  (SPI_MEM_C_CS_SETUP_V << SPI_MEM_C_CS_SETUP_S)
#define SPI_MEM_C_CS_SETUP_V  0x00000001U
#define SPI_MEM_C_CS_SETUP_S  7
/** SPI_MEM_C_CK_OUT_EDGE : R/W; bitpos: [9]; default: 0;
 *  The bit combined with SPI_MEM_C_CK_IDLE_EDGE bit to control SPI clock mode 0~3.
 */
#define SPI_MEM_C_CK_OUT_EDGE    (BIT(9))
#define SPI_MEM_C_CK_OUT_EDGE_M  (SPI_MEM_C_CK_OUT_EDGE_V << SPI_MEM_C_CK_OUT_EDGE_S)
#define SPI_MEM_C_CK_OUT_EDGE_V  0x00000001U
#define SPI_MEM_C_CK_OUT_EDGE_S  9
/** SPI_MEM_C_USR_DUMMY_IDLE : R/W; bitpos: [26]; default: 0;
 *  spi clock is disable in dummy phase when the bit is enable.
 */
#define SPI_MEM_C_USR_DUMMY_IDLE    (BIT(26))
#define SPI_MEM_C_USR_DUMMY_IDLE_M  (SPI_MEM_C_USR_DUMMY_IDLE_V << SPI_MEM_C_USR_DUMMY_IDLE_S)
#define SPI_MEM_C_USR_DUMMY_IDLE_V  0x00000001U
#define SPI_MEM_C_USR_DUMMY_IDLE_S  26
/** SPI_MEM_C_USR_DUMMY : R/W; bitpos: [29]; default: 0;
 *  This bit enable the dummy phase of an operation.
 */
#define SPI_MEM_C_USR_DUMMY    (BIT(29))
#define SPI_MEM_C_USR_DUMMY_M  (SPI_MEM_C_USR_DUMMY_V << SPI_MEM_C_USR_DUMMY_S)
#define SPI_MEM_C_USR_DUMMY_V  0x00000001U
#define SPI_MEM_C_USR_DUMMY_S  29

/** SPI_MEM_C_USER1_REG register
 *  SPI0 user1 register.
 */
#define SPI_MEM_C_USER1_REG (DR_REG_FLASH_SPI0_BASE + 0x1c)
/** SPI_MEM_C_USR_DUMMY_CYCLELEN : R/W; bitpos: [5:0]; default: 7;
 *  The length in spi_mem_clk cycles of dummy phase. The register value shall be
 *  (cycle_num-1).
 */
#define SPI_MEM_C_USR_DUMMY_CYCLELEN    0x0000003FU
#define SPI_MEM_C_USR_DUMMY_CYCLELEN_M  (SPI_MEM_C_USR_DUMMY_CYCLELEN_V << SPI_MEM_C_USR_DUMMY_CYCLELEN_S)
#define SPI_MEM_C_USR_DUMMY_CYCLELEN_V  0x0000003FU
#define SPI_MEM_C_USR_DUMMY_CYCLELEN_S  0
/** SPI_MEM_C_USR_DBYTELEN : HRO; bitpos: [8:6]; default: 1;
 *  SPI0 USR_CMD read or write data byte length -1
 */
#define SPI_MEM_C_USR_DBYTELEN    0x00000007U
#define SPI_MEM_C_USR_DBYTELEN_M  (SPI_MEM_C_USR_DBYTELEN_V << SPI_MEM_C_USR_DBYTELEN_S)
#define SPI_MEM_C_USR_DBYTELEN_V  0x00000007U
#define SPI_MEM_C_USR_DBYTELEN_S  6
/** SPI_MEM_C_USR_ADDR_BITLEN : R/W; bitpos: [31:26]; default: 23;
 *  The length in bits of address phase. The register value shall be (bit_num-1).
 */
#define SPI_MEM_C_USR_ADDR_BITLEN    0x0000003FU
#define SPI_MEM_C_USR_ADDR_BITLEN_M  (SPI_MEM_C_USR_ADDR_BITLEN_V << SPI_MEM_C_USR_ADDR_BITLEN_S)
#define SPI_MEM_C_USR_ADDR_BITLEN_V  0x0000003FU
#define SPI_MEM_C_USR_ADDR_BITLEN_S  26

/** SPI_MEM_C_USER2_REG register
 *  SPI0 user2 register.
 */
#define SPI_MEM_C_USER2_REG (DR_REG_FLASH_SPI0_BASE + 0x20)
/** SPI_MEM_C_USR_COMMAND_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  The value of  command.
 */
#define SPI_MEM_C_USR_COMMAND_VALUE    0x0000FFFFU
#define SPI_MEM_C_USR_COMMAND_VALUE_M  (SPI_MEM_C_USR_COMMAND_VALUE_V << SPI_MEM_C_USR_COMMAND_VALUE_S)
#define SPI_MEM_C_USR_COMMAND_VALUE_V  0x0000FFFFU
#define SPI_MEM_C_USR_COMMAND_VALUE_S  0
/** SPI_MEM_C_USR_COMMAND_BITLEN : R/W; bitpos: [31:28]; default: 7;
 *  The length in bits of command phase. The register value shall be (bit_num-1)
 */
#define SPI_MEM_C_USR_COMMAND_BITLEN    0x0000000FU
#define SPI_MEM_C_USR_COMMAND_BITLEN_M  (SPI_MEM_C_USR_COMMAND_BITLEN_V << SPI_MEM_C_USR_COMMAND_BITLEN_S)
#define SPI_MEM_C_USR_COMMAND_BITLEN_V  0x0000000FU
#define SPI_MEM_C_USR_COMMAND_BITLEN_S  28

/** SPI_MEM_C_RD_STATUS_REG register
 *  SPI0 read control register.
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_RD_STATUS_REG (DR_REG_FLASH_SPI0_BASE + 0x2c)
/** SPI_MEM_C_WB_MODE : R/W; bitpos: [23:16]; default: 0;
 *  Mode bits in the flash fast read mode  it is combined with spi_mem_fastrd_mode bit.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_WB_MODE    0x000000FFU
#define SPI_MEM_C_WB_MODE_M  (SPI_MEM_C_WB_MODE_V << SPI_MEM_C_WB_MODE_S)
#define SPI_MEM_C_WB_MODE_V  0x000000FFU
#define SPI_MEM_C_WB_MODE_S  16

/** SPI_MEM_C_MISC_REG register
 *  SPI0 misc register
 */
#define SPI_MEM_C_MISC_REG (DR_REG_FLASH_SPI0_BASE + 0x34)
/** SPI_MEM_C_DQ_OE_CTRL : R/W; bitpos: [4]; default: 1;
 *  For SPI BUS IO,  APB ctrl IO DQ OE func.1: enable 0: disable.
 */
#define SPI_MEM_C_DQ_OE_CTRL    (BIT(4))
#define SPI_MEM_C_DQ_OE_CTRL_M  (SPI_MEM_C_DQ_OE_CTRL_V << SPI_MEM_C_DQ_OE_CTRL_S)
#define SPI_MEM_C_DQ_OE_CTRL_V  0x00000001U
#define SPI_MEM_C_DQ_OE_CTRL_S  4
/** SPI_MEM_C_CK_OE_CTRL : R/W; bitpos: [5]; default: 1;
 *  For SPI BUS IO,  APB ctrl IO CK OE func.1: enable 0: disable.
 */
#define SPI_MEM_C_CK_OE_CTRL    (BIT(5))
#define SPI_MEM_C_CK_OE_CTRL_M  (SPI_MEM_C_CK_OE_CTRL_V << SPI_MEM_C_CK_OE_CTRL_S)
#define SPI_MEM_C_CK_OE_CTRL_V  0x00000001U
#define SPI_MEM_C_CK_OE_CTRL_S  5
/** SPI_MEM_C_CS_OE_CTRL : R/W; bitpos: [6]; default: 1;
 *  For SPI BUS IO,  APB ctrl IO CS OE func.1: enable 0: disable.
 */
#define SPI_MEM_C_CS_OE_CTRL    (BIT(6))
#define SPI_MEM_C_CS_OE_CTRL_M  (SPI_MEM_C_CS_OE_CTRL_V << SPI_MEM_C_CS_OE_CTRL_S)
#define SPI_MEM_C_CS_OE_CTRL_V  0x00000001U
#define SPI_MEM_C_CS_OE_CTRL_S  6
/** SPI_MEM_C_FSUB_PIN : HRO; bitpos: [7]; default: 0;
 *  For SPI0,  flash is connected to SUBPINs.
 */
#define SPI_MEM_C_FSUB_PIN    (BIT(7))
#define SPI_MEM_C_FSUB_PIN_M  (SPI_MEM_C_FSUB_PIN_V << SPI_MEM_C_FSUB_PIN_S)
#define SPI_MEM_C_FSUB_PIN_V  0x00000001U
#define SPI_MEM_C_FSUB_PIN_S  7
/** SPI_MEM_C_SSUB_PIN : HRO; bitpos: [8]; default: 0;
 *  For SPI0,  sram is connected to SUBPINs.
 */
#define SPI_MEM_C_SSUB_PIN    (BIT(8))
#define SPI_MEM_C_SSUB_PIN_M  (SPI_MEM_C_SSUB_PIN_V << SPI_MEM_C_SSUB_PIN_S)
#define SPI_MEM_C_SSUB_PIN_V  0x00000001U
#define SPI_MEM_C_SSUB_PIN_S  8
/** SPI_MEM_C_CK_IDLE_EDGE : R/W; bitpos: [9]; default: 0;
 *  1: SPI_CLK line is high when idle     0: spi clk line is low when idle
 */
#define SPI_MEM_C_CK_IDLE_EDGE    (BIT(9))
#define SPI_MEM_C_CK_IDLE_EDGE_M  (SPI_MEM_C_CK_IDLE_EDGE_V << SPI_MEM_C_CK_IDLE_EDGE_S)
#define SPI_MEM_C_CK_IDLE_EDGE_V  0x00000001U
#define SPI_MEM_C_CK_IDLE_EDGE_S  9
/** SPI_MEM_C_CS_KEEP_ACTIVE : R/W; bitpos: [10]; default: 0;
 *  SPI_CS line keep low when the bit is set.
 */
#define SPI_MEM_C_CS_KEEP_ACTIVE    (BIT(10))
#define SPI_MEM_C_CS_KEEP_ACTIVE_M  (SPI_MEM_C_CS_KEEP_ACTIVE_V << SPI_MEM_C_CS_KEEP_ACTIVE_S)
#define SPI_MEM_C_CS_KEEP_ACTIVE_V  0x00000001U
#define SPI_MEM_C_CS_KEEP_ACTIVE_S  10

/** SPI_MEM_C_CACHE_FCTRL_REG register
 *  SPI0 bit mode control register.
 */
#define SPI_MEM_C_CACHE_FCTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x3c)
/** SPI_MEM_C_AXI_REQ_EN : R/W; bitpos: [0]; default: 0;
 *  For SPI0, AXI master access enable, 1: enable, 0:disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_AXI_REQ_EN    (BIT(0))
#define SPI_MEM_C_AXI_REQ_EN_M  (SPI_MEM_C_AXI_REQ_EN_V << SPI_MEM_C_AXI_REQ_EN_S)
#define SPI_MEM_C_AXI_REQ_EN_V  0x00000001U
#define SPI_MEM_C_AXI_REQ_EN_S  0
/** SPI_MEM_C_CACHE_USR_ADDR_4BYTE : R/W; bitpos: [1]; default: 0;
 *  For SPI0,  cache  read flash with 4 bytes address, 1: enable, 0:disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_USR_ADDR_4BYTE    (BIT(1))
#define SPI_MEM_C_CACHE_USR_ADDR_4BYTE_M  (SPI_MEM_C_CACHE_USR_ADDR_4BYTE_V << SPI_MEM_C_CACHE_USR_ADDR_4BYTE_S)
#define SPI_MEM_C_CACHE_USR_ADDR_4BYTE_V  0x00000001U
#define SPI_MEM_C_CACHE_USR_ADDR_4BYTE_S  1
/** SPI_MEM_C_CACHE_FLASH_USR_CMD : R/W; bitpos: [2]; default: 0;
 *  For SPI0,  cache  read flash for user define command, 1: enable, 0:disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_FLASH_USR_CMD    (BIT(2))
#define SPI_MEM_C_CACHE_FLASH_USR_CMD_M  (SPI_MEM_C_CACHE_FLASH_USR_CMD_V << SPI_MEM_C_CACHE_FLASH_USR_CMD_S)
#define SPI_MEM_C_CACHE_FLASH_USR_CMD_V  0x00000001U
#define SPI_MEM_C_CACHE_FLASH_USR_CMD_S  2
/** SPI_MEM_C_FDIN_DUAL : R/W; bitpos: [3]; default: 0;
 *  For SPI0 flash, din phase apply 2 signals. 1: enable 0: disable. The bit is the
 *  same with spi_mem_fread_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_FDIN_DUAL    (BIT(3))
#define SPI_MEM_C_FDIN_DUAL_M  (SPI_MEM_C_FDIN_DUAL_V << SPI_MEM_C_FDIN_DUAL_S)
#define SPI_MEM_C_FDIN_DUAL_V  0x00000001U
#define SPI_MEM_C_FDIN_DUAL_S  3
/** SPI_MEM_C_FDOUT_DUAL : R/W; bitpos: [4]; default: 0;
 *  For SPI0 flash, dout phase apply 2 signals. 1: enable 0: disable. The bit is the
 *  same with spi_mem_fread_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_FDOUT_DUAL    (BIT(4))
#define SPI_MEM_C_FDOUT_DUAL_M  (SPI_MEM_C_FDOUT_DUAL_V << SPI_MEM_C_FDOUT_DUAL_S)
#define SPI_MEM_C_FDOUT_DUAL_V  0x00000001U
#define SPI_MEM_C_FDOUT_DUAL_S  4
/** SPI_MEM_C_FADDR_DUAL : R/W; bitpos: [5]; default: 0;
 *  For SPI0 flash, address phase apply 2 signals. 1: enable 0: disable.  The bit is
 *  the same with spi_mem_fread_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_FADDR_DUAL    (BIT(5))
#define SPI_MEM_C_FADDR_DUAL_M  (SPI_MEM_C_FADDR_DUAL_V << SPI_MEM_C_FADDR_DUAL_S)
#define SPI_MEM_C_FADDR_DUAL_V  0x00000001U
#define SPI_MEM_C_FADDR_DUAL_S  5
/** SPI_MEM_C_FDIN_QUAD : R/W; bitpos: [6]; default: 0;
 *  For SPI0 flash, din phase apply 4 signals. 1: enable 0: disable.  The bit is the
 *  same with spi_mem_fread_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_FDIN_QUAD    (BIT(6))
#define SPI_MEM_C_FDIN_QUAD_M  (SPI_MEM_C_FDIN_QUAD_V << SPI_MEM_C_FDIN_QUAD_S)
#define SPI_MEM_C_FDIN_QUAD_V  0x00000001U
#define SPI_MEM_C_FDIN_QUAD_S  6
/** SPI_MEM_C_FDOUT_QUAD : R/W; bitpos: [7]; default: 0;
 *  For SPI0 flash, dout phase apply 4 signals. 1: enable 0: disable.  The bit is the
 *  same with spi_mem_fread_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_FDOUT_QUAD    (BIT(7))
#define SPI_MEM_C_FDOUT_QUAD_M  (SPI_MEM_C_FDOUT_QUAD_V << SPI_MEM_C_FDOUT_QUAD_S)
#define SPI_MEM_C_FDOUT_QUAD_V  0x00000001U
#define SPI_MEM_C_FDOUT_QUAD_S  7
/** SPI_MEM_C_FADDR_QUAD : R/W; bitpos: [8]; default: 0;
 *  For SPI0 flash, address phase apply 4 signals. 1: enable 0: disable.  The bit is
 *  the same with spi_mem_fread_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_FADDR_QUAD    (BIT(8))
#define SPI_MEM_C_FADDR_QUAD_M  (SPI_MEM_C_FADDR_QUAD_V << SPI_MEM_C_FADDR_QUAD_S)
#define SPI_MEM_C_FADDR_QUAD_V  0x00000001U
#define SPI_MEM_C_FADDR_QUAD_S  8
/** SPI_MEM_C_ARB_WEI_EN : HRO; bitpos: [9]; default: 0;
 *  To enable SPI0 arbiter weight func while AXI read/write access SPI0  1: enable 0:
 *  disable.
 */
#define SPI_MEM_C_ARB_WEI_EN    (BIT(9))
#define SPI_MEM_C_ARB_WEI_EN_M  (SPI_MEM_C_ARB_WEI_EN_V << SPI_MEM_C_ARB_WEI_EN_S)
#define SPI_MEM_C_ARB_WEI_EN_V  0x00000001U
#define SPI_MEM_C_ARB_WEI_EN_S  9
/** SPI_MEM_C_ARB_REQ0_PRI : HRO; bitpos: [10]; default: 0;
 *  To set AXI read priority in SPI0 arbiter. The larger the value, the greater the
 *  priority.
 */
#define SPI_MEM_C_ARB_REQ0_PRI    (BIT(10))
#define SPI_MEM_C_ARB_REQ0_PRI_M  (SPI_MEM_C_ARB_REQ0_PRI_V << SPI_MEM_C_ARB_REQ0_PRI_S)
#define SPI_MEM_C_ARB_REQ0_PRI_V  0x00000001U
#define SPI_MEM_C_ARB_REQ0_PRI_S  10
/** SPI_MEM_C_ARB_REQ1_PRI : HRO; bitpos: [11]; default: 0;
 *  To set AXI write priority in SPI0 arbiter. The larger the value, the greater the
 *  priority.
 */
#define SPI_MEM_C_ARB_REQ1_PRI    (BIT(11))
#define SPI_MEM_C_ARB_REQ1_PRI_M  (SPI_MEM_C_ARB_REQ1_PRI_V << SPI_MEM_C_ARB_REQ1_PRI_S)
#define SPI_MEM_C_ARB_REQ1_PRI_V  0x00000001U
#define SPI_MEM_C_ARB_REQ1_PRI_S  11
/** SPI_MEM_C_ARB_REQ0_WEI : HRO; bitpos: [15:12]; default: 0;
 *  To set AXI read priority weight in SPI0 arbiter. While the priority are same, the
 *  larger the value, the greater the weight.
 */
#define SPI_MEM_C_ARB_REQ0_WEI    0x0000000FU
#define SPI_MEM_C_ARB_REQ0_WEI_M  (SPI_MEM_C_ARB_REQ0_WEI_V << SPI_MEM_C_ARB_REQ0_WEI_S)
#define SPI_MEM_C_ARB_REQ0_WEI_V  0x0000000FU
#define SPI_MEM_C_ARB_REQ0_WEI_S  12
/** SPI_MEM_C_ARB_REQ1_WEI : HRO; bitpos: [19:16]; default: 0;
 *  To set AXI write priority weight in SPI0 arbiter. While the priority are same, the
 *  larger the value, the greater the weight.
 */
#define SPI_MEM_C_ARB_REQ1_WEI    0x0000000FU
#define SPI_MEM_C_ARB_REQ1_WEI_M  (SPI_MEM_C_ARB_REQ1_WEI_V << SPI_MEM_C_ARB_REQ1_WEI_S)
#define SPI_MEM_C_ARB_REQ1_WEI_V  0x0000000FU
#define SPI_MEM_C_ARB_REQ1_WEI_S  16
/** SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN : HRO; bitpos: [30]; default: 1;
 *  Set this bit to check AXI read/write the same address region.
 */
#define SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN    (BIT(30))
#define SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN_M  (SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN_V << SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN_S)
#define SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN_V  0x00000001U
#define SPI_MEM_C_SAME_AW_AR_ADDR_CHK_EN_S  30
/** SPI_MEM_C_CLOSE_AXI_INF_EN : R/W; bitpos: [31]; default: 1;
 *  Set this bit to close AXI read/write transfer to MSPI, which means that only
 *  SLV_ERR will be replied to BRESP/RRESP.
 */
#define SPI_MEM_C_CLOSE_AXI_INF_EN    (BIT(31))
#define SPI_MEM_C_CLOSE_AXI_INF_EN_M  (SPI_MEM_C_CLOSE_AXI_INF_EN_V << SPI_MEM_C_CLOSE_AXI_INF_EN_S)
#define SPI_MEM_C_CLOSE_AXI_INF_EN_V  0x00000001U
#define SPI_MEM_C_CLOSE_AXI_INF_EN_S  31

/** SPI_MEM_C_CACHE_SCTRL_REG register
 *  SPI0 external RAM control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_CACHE_SCTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x40)
/** SPI_MEM_C_CACHE_USR_SADDR_4BYTE : HRO; bitpos: [0]; default: 0;
 *  For SPI0, In the external RAM mode, cache read flash with 4 bytes command, 1:
 *  enable, 0:disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_USR_SADDR_4BYTE    (BIT(0))
#define SPI_MEM_C_CACHE_USR_SADDR_4BYTE_M  (SPI_MEM_C_CACHE_USR_SADDR_4BYTE_V << SPI_MEM_C_CACHE_USR_SADDR_4BYTE_S)
#define SPI_MEM_C_CACHE_USR_SADDR_4BYTE_V  0x00000001U
#define SPI_MEM_C_CACHE_USR_SADDR_4BYTE_S  0
/** SPI_MEM_C_USR_SRAM_DIO : HRO; bitpos: [1]; default: 0;
 *  For SPI0, In the external RAM mode, spi dual I/O mode enable, 1: enable, 0:disable
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_USR_SRAM_DIO    (BIT(1))
#define SPI_MEM_C_USR_SRAM_DIO_M  (SPI_MEM_C_USR_SRAM_DIO_V << SPI_MEM_C_USR_SRAM_DIO_S)
#define SPI_MEM_C_USR_SRAM_DIO_V  0x00000001U
#define SPI_MEM_C_USR_SRAM_DIO_S  1
/** SPI_MEM_C_USR_SRAM_QIO : HRO; bitpos: [2]; default: 0;
 *  For SPI0, In the external RAM mode, spi quad I/O mode enable, 1: enable, 0:disable
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_USR_SRAM_QIO    (BIT(2))
#define SPI_MEM_C_USR_SRAM_QIO_M  (SPI_MEM_C_USR_SRAM_QIO_V << SPI_MEM_C_USR_SRAM_QIO_S)
#define SPI_MEM_C_USR_SRAM_QIO_V  0x00000001U
#define SPI_MEM_C_USR_SRAM_QIO_S  2
/** SPI_MEM_C_USR_WR_SRAM_DUMMY : HRO; bitpos: [3]; default: 0;
 *  For SPI0, In the external RAM mode, it is the enable bit of dummy phase for write
 *  operations.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_USR_WR_SRAM_DUMMY    (BIT(3))
#define SPI_MEM_C_USR_WR_SRAM_DUMMY_M  (SPI_MEM_C_USR_WR_SRAM_DUMMY_V << SPI_MEM_C_USR_WR_SRAM_DUMMY_S)
#define SPI_MEM_C_USR_WR_SRAM_DUMMY_V  0x00000001U
#define SPI_MEM_C_USR_WR_SRAM_DUMMY_S  3
/** SPI_MEM_C_USR_RD_SRAM_DUMMY : HRO; bitpos: [4]; default: 1;
 *  For SPI0, In the external RAM mode, it is the enable bit of dummy phase for read
 *  operations.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_USR_RD_SRAM_DUMMY    (BIT(4))
#define SPI_MEM_C_USR_RD_SRAM_DUMMY_M  (SPI_MEM_C_USR_RD_SRAM_DUMMY_V << SPI_MEM_C_USR_RD_SRAM_DUMMY_S)
#define SPI_MEM_C_USR_RD_SRAM_DUMMY_V  0x00000001U
#define SPI_MEM_C_USR_RD_SRAM_DUMMY_S  4
/** SPI_MEM_C_CACHE_SRAM_USR_RCMD : HRO; bitpos: [5]; default: 1;
 *  For SPI0, In the external RAM mode cache read external RAM for user define command.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_SRAM_USR_RCMD    (BIT(5))
#define SPI_MEM_C_CACHE_SRAM_USR_RCMD_M  (SPI_MEM_C_CACHE_SRAM_USR_RCMD_V << SPI_MEM_C_CACHE_SRAM_USR_RCMD_S)
#define SPI_MEM_C_CACHE_SRAM_USR_RCMD_V  0x00000001U
#define SPI_MEM_C_CACHE_SRAM_USR_RCMD_S  5
/** SPI_MEM_C_SRAM_RDUMMY_CYCLELEN : HRO; bitpos: [11:6]; default: 1;
 *  For SPI0, In the external RAM mode, it is the length in bits of read dummy phase.
 *  The register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SRAM_RDUMMY_CYCLELEN    0x0000003FU
#define SPI_MEM_C_SRAM_RDUMMY_CYCLELEN_M  (SPI_MEM_C_SRAM_RDUMMY_CYCLELEN_V << SPI_MEM_C_SRAM_RDUMMY_CYCLELEN_S)
#define SPI_MEM_C_SRAM_RDUMMY_CYCLELEN_V  0x0000003FU
#define SPI_MEM_C_SRAM_RDUMMY_CYCLELEN_S  6
/** SPI_MEM_C_SRAM_ADDR_BITLEN : HRO; bitpos: [19:14]; default: 23;
 *  For SPI0, In the external RAM mode, it is the length in bits of address phase. The
 *  register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SRAM_ADDR_BITLEN    0x0000003FU
#define SPI_MEM_C_SRAM_ADDR_BITLEN_M  (SPI_MEM_C_SRAM_ADDR_BITLEN_V << SPI_MEM_C_SRAM_ADDR_BITLEN_S)
#define SPI_MEM_C_SRAM_ADDR_BITLEN_V  0x0000003FU
#define SPI_MEM_C_SRAM_ADDR_BITLEN_S  14
/** SPI_MEM_C_CACHE_SRAM_USR_WCMD : HRO; bitpos: [20]; default: 1;
 *  For SPI0, In the external RAM mode cache write sram for user define command
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_CACHE_SRAM_USR_WCMD    (BIT(20))
#define SPI_MEM_C_CACHE_SRAM_USR_WCMD_M  (SPI_MEM_C_CACHE_SRAM_USR_WCMD_V << SPI_MEM_C_CACHE_SRAM_USR_WCMD_S)
#define SPI_MEM_C_CACHE_SRAM_USR_WCMD_V  0x00000001U
#define SPI_MEM_C_CACHE_SRAM_USR_WCMD_S  20
/** SPI_MEM_C_SRAM_OCT : HRO; bitpos: [21]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SRAM_OCT    (BIT(21))
#define SPI_MEM_C_SRAM_OCT_M  (SPI_MEM_C_SRAM_OCT_V << SPI_MEM_C_SRAM_OCT_S)
#define SPI_MEM_C_SRAM_OCT_V  0x00000001U
#define SPI_MEM_C_SRAM_OCT_S  21
/** SPI_MEM_C_SRAM_WDUMMY_CYCLELEN : HRO; bitpos: [27:22]; default: 1;
 *  For SPI0, In the external RAM mode, it is the length in bits of write dummy phase.
 *  The register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_SRAM_WDUMMY_CYCLELEN    0x0000003FU
#define SPI_MEM_C_SRAM_WDUMMY_CYCLELEN_M  (SPI_MEM_C_SRAM_WDUMMY_CYCLELEN_V << SPI_MEM_C_SRAM_WDUMMY_CYCLELEN_S)
#define SPI_MEM_C_SRAM_WDUMMY_CYCLELEN_V  0x0000003FU
#define SPI_MEM_C_SRAM_WDUMMY_CYCLELEN_S  22

