espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_c_reg.h
/** SPI_MEM_C_SMEM_PMS3_ATTR_REG register
 *  SPI1 external RAM PMS section 3 attribute register
 */
#define SPI_MEM_C_SMEM_PMS3_ATTR_REG (DR_REG_FLASH_SPI0_BASE + 0x13c)
/** SPI_MEM_C_SMEM_PMS3_RD_ATTR : R/W; bitpos: [0]; default: 1;
 *  1: SPI1 external RAM PMS section 3 read accessible. 0: Not allowed.
 */
#define SPI_MEM_C_SMEM_PMS3_RD_ATTR    (BIT(0))
#define SPI_MEM_C_SMEM_PMS3_RD_ATTR_M  (SPI_MEM_C_SMEM_PMS3_RD_ATTR_V << SPI_MEM_C_SMEM_PMS3_RD_ATTR_S)
#define SPI_MEM_C_SMEM_PMS3_RD_ATTR_V  0x00000001U
#define SPI_MEM_C_SMEM_PMS3_RD_ATTR_S  0
/** SPI_MEM_C_SMEM_PMS3_WR_ATTR : R/W; bitpos: [1]; default: 1;
 *  1: SPI1 external RAM PMS section 3 write accessible. 0: Not allowed.
 */
#define SPI_MEM_C_SMEM_PMS3_WR_ATTR    (BIT(1))
#define SPI_MEM_C_SMEM_PMS3_WR_ATTR_M  (SPI_MEM_C_SMEM_PMS3_WR_ATTR_V << SPI_MEM_C_SMEM_PMS3_WR_ATTR_S)
#define SPI_MEM_C_SMEM_PMS3_WR_ATTR_V  0x00000001U
#define SPI_MEM_C_SMEM_PMS3_WR_ATTR_S  1
/** SPI_MEM_C_SMEM_PMS3_ECC : R/W; bitpos: [2]; default: 0;
 *  SPI1 external RAM PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it. The
 *  external RAM PMS section 3 is configured by registers SPI_MEM_C_SMEM_PMS3_ADDR_REG
 *  and SPI_MEM_C_SMEM_PMS3_SIZE_REG.
 */
#define SPI_MEM_C_SMEM_PMS3_ECC    (BIT(2))
#define SPI_MEM_C_SMEM_PMS3_ECC_M  (SPI_MEM_C_SMEM_PMS3_ECC_V << SPI_MEM_C_SMEM_PMS3_ECC_S)
#define SPI_MEM_C_SMEM_PMS3_ECC_V  0x00000001U
#define SPI_MEM_C_SMEM_PMS3_ECC_S  2
/** SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR : R/W; bitpos: [3]; default: 1;
 *  1: SPI1 external RAM non-secure PMS section 3 read accessible. 0: Not allowed.
 */
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR    (BIT(3))
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR_M  (SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR_V << SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR_S)
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR_V  0x00000001U
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_RD_ATTR_S  3
/** SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR : R/W; bitpos: [4]; default: 1;
 *  1: SPI1 external RAM non-secure PMS section 3 write accessible. 0: Not allowed.
 */
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR    (BIT(4))
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR_M  (SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR_V << SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR_S)
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR_V  0x00000001U
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_WR_ATTR_S  4
/** SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC : R/W; bitpos: [5]; default: 0;
 *  SPI1 external RAM non-secure PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable
 *  it. The external RAM PMS section 3 is configured by registers
 *  SPI_MEM_C_SMEM_PMS3_ADDR_REG and SPI_MEM_C_SMEM_PMS3_SIZE_REG.
 */
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC    (BIT(5))
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC_M  (SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC_V << SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC_S)
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC_V  0x00000001U
#define SPI_MEM_C_SMEM_PMS3_NONSECURE_ECC_S  5

/** SPI_MEM_C_SMEM_PMS0_ADDR_REG register
 *  SPI1 external RAM PMS section 0 start address register
 */
#define SPI_MEM_C_SMEM_PMS0_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x140)
/** SPI_MEM_C_SMEM_PMS0_ADDR_S : R/W; bitpos: [26:0]; default: 0;
 *  SPI1 external RAM PMS section 0 start address value
 */
#define SPI_MEM_C_SMEM_PMS0_ADDR_S    0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS0_ADDR_S_M  (SPI_MEM_C_SMEM_PMS0_ADDR_S_V << SPI_MEM_C_SMEM_PMS0_ADDR_S_S)
#define SPI_MEM_C_SMEM_PMS0_ADDR_S_V  0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS0_ADDR_S_S  0

/** SPI_MEM_C_SMEM_PMS1_ADDR_REG register
 *  SPI1 external RAM PMS section 1 start address register
 */
#define SPI_MEM_C_SMEM_PMS1_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x144)
/** SPI_MEM_C_SMEM_PMS1_ADDR_S : R/W; bitpos: [26:0]; default: 0;
 *  SPI1 external RAM PMS section 1 start address value
 */
#define SPI_MEM_C_SMEM_PMS1_ADDR_S    0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS1_ADDR_S_M  (SPI_MEM_C_SMEM_PMS1_ADDR_S_V << SPI_MEM_C_SMEM_PMS1_ADDR_S_S)
#define SPI_MEM_C_SMEM_PMS1_ADDR_S_V  0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS1_ADDR_S_S  0

/** SPI_MEM_C_SMEM_PMS2_ADDR_REG register
 *  SPI1 external RAM PMS section 2 start address register
 */
#define SPI_MEM_C_SMEM_PMS2_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x148)
/** SPI_MEM_C_SMEM_PMS2_ADDR_S : R/W; bitpos: [26:0]; default: 0;
 *  SPI1 external RAM PMS section 2 start address value
 */
#define SPI_MEM_C_SMEM_PMS2_ADDR_S    0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS2_ADDR_S_M  (SPI_MEM_C_SMEM_PMS2_ADDR_S_V << SPI_MEM_C_SMEM_PMS2_ADDR_S_S)
#define SPI_MEM_C_SMEM_PMS2_ADDR_S_V  0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS2_ADDR_S_S  0

/** SPI_MEM_C_SMEM_PMS3_ADDR_REG register
 *  SPI1 external RAM PMS section 3 start address register
 */
#define SPI_MEM_C_SMEM_PMS3_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x14c)
/** SPI_MEM_C_SMEM_PMS3_ADDR_S : R/W; bitpos: [26:0]; default: 0;
 *  SPI1 external RAM PMS section 3 start address value
 */
#define SPI_MEM_C_SMEM_PMS3_ADDR_S    0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS3_ADDR_S_M  (SPI_MEM_C_SMEM_PMS3_ADDR_S_V << SPI_MEM_C_SMEM_PMS3_ADDR_S_S)
#define SPI_MEM_C_SMEM_PMS3_ADDR_S_V  0x07FFFFFFU
#define SPI_MEM_C_SMEM_PMS3_ADDR_S_S  0

/** SPI_MEM_C_SMEM_PMS0_SIZE_REG register
 *  SPI1 external RAM PMS section 0 start address register
 */
#define SPI_MEM_C_SMEM_PMS0_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x150)
/** SPI_MEM_C_SMEM_PMS0_SIZE : R/W; bitpos: [14:0]; default: 4096;
 *  SPI1 external RAM PMS section 0 address region is (SPI_MEM_C_SMEM_PMS0_ADDR_S,
 *  SPI_MEM_C_SMEM_PMS0_ADDR_S + SPI_MEM_C_SMEM_PMS0_SIZE)
 */
#define SPI_MEM_C_SMEM_PMS0_SIZE    0x00007FFFU
#define SPI_MEM_C_SMEM_PMS0_SIZE_M  (SPI_MEM_C_SMEM_PMS0_SIZE_V << SPI_MEM_C_SMEM_PMS0_SIZE_S)
#define SPI_MEM_C_SMEM_PMS0_SIZE_V  0x00007FFFU
#define SPI_MEM_C_SMEM_PMS0_SIZE_S  0

/** SPI_MEM_C_SMEM_PMS1_SIZE_REG register
 *  SPI1 external RAM PMS section 1 start address register
 */
#define SPI_MEM_C_SMEM_PMS1_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x154)
/** SPI_MEM_C_SMEM_PMS1_SIZE : R/W; bitpos: [14:0]; default: 4096;
 *  SPI1 external RAM PMS section 1 address region is (SPI_MEM_C_SMEM_PMS1_ADDR_S,
 *  SPI_MEM_C_SMEM_PMS1_ADDR_S + SPI_MEM_C_SMEM_PMS1_SIZE)
 */
#define SPI_MEM_C_SMEM_PMS1_SIZE    0x00007FFFU
#define SPI_MEM_C_SMEM_PMS1_SIZE_M  (SPI_MEM_C_SMEM_PMS1_SIZE_V << SPI_MEM_C_SMEM_PMS1_SIZE_S)
#define SPI_MEM_C_SMEM_PMS1_SIZE_V  0x00007FFFU
#define SPI_MEM_C_SMEM_PMS1_SIZE_S  0

/** SPI_MEM_C_SMEM_PMS2_SIZE_REG register
 *  SPI1 external RAM PMS section 2 start address register
 */
#define SPI_MEM_C_SMEM_PMS2_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x158)
/** SPI_MEM_C_SMEM_PMS2_SIZE : R/W; bitpos: [14:0]; default: 4096;
 *  SPI1 external RAM PMS section 2 address region is (SPI_MEM_C_SMEM_PMS2_ADDR_S,
 *  SPI_MEM_C_SMEM_PMS2_ADDR_S + SPI_MEM_C_SMEM_PMS2_SIZE)
 */
#define SPI_MEM_C_SMEM_PMS2_SIZE    0x00007FFFU
#define SPI_MEM_C_SMEM_PMS2_SIZE_M  (SPI_MEM_C_SMEM_PMS2_SIZE_V << SPI_MEM_C_SMEM_PMS2_SIZE_S)
#define SPI_MEM_C_SMEM_PMS2_SIZE_V  0x00007FFFU
#define SPI_MEM_C_SMEM_PMS2_SIZE_S  0

/** SPI_MEM_C_SMEM_PMS3_SIZE_REG register
 *  SPI1 external RAM PMS section 3 start address register
 */
#define SPI_MEM_C_SMEM_PMS3_SIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x15c)
/** SPI_MEM_C_SMEM_PMS3_SIZE : R/W; bitpos: [14:0]; default: 4096;
 *  SPI1 external RAM PMS section 3 address region is (SPI_MEM_C_SMEM_PMS3_ADDR_S,
 *  SPI_MEM_C_SMEM_PMS3_ADDR_S + SPI_MEM_C_SMEM_PMS3_SIZE)
 */
#define SPI_MEM_C_SMEM_PMS3_SIZE    0x00007FFFU
#define SPI_MEM_C_SMEM_PMS3_SIZE_M  (SPI_MEM_C_SMEM_PMS3_SIZE_V << SPI_MEM_C_SMEM_PMS3_SIZE_S)
#define SPI_MEM_C_SMEM_PMS3_SIZE_V  0x00007FFFU
#define SPI_MEM_C_SMEM_PMS3_SIZE_S  0

/** SPI_MEM_C_PMS_REJECT_REG register
 *  SPI1 access reject register
 */
#define SPI_MEM_C_PMS_REJECT_REG (DR_REG_FLASH_SPI0_BASE + 0x164)
/** SPI_MEM_C_REJECT_ADDR : R/SS/WTC; bitpos: [26:0]; default: 0;
 *  This bits show the first SPI1 access error address. It is cleared by when
 *  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_REJECT_ADDR    0x07FFFFFFU
#define SPI_MEM_C_REJECT_ADDR_M  (SPI_MEM_C_REJECT_ADDR_V << SPI_MEM_C_REJECT_ADDR_S)
#define SPI_MEM_C_REJECT_ADDR_V  0x07FFFFFFU
#define SPI_MEM_C_REJECT_ADDR_S  0
/** SPI_MEM_C_PM_EN : R/W; bitpos: [27]; default: 0;
 *  Set this bit to enable SPI0/1 transfer permission control function.
 */
#define SPI_MEM_C_PM_EN    (BIT(27))
#define SPI_MEM_C_PM_EN_M  (SPI_MEM_C_PM_EN_V << SPI_MEM_C_PM_EN_S)
#define SPI_MEM_C_PM_EN_V  0x00000001U
#define SPI_MEM_C_PM_EN_S  27
/** SPI_MEM_C_PMS_LD : R/SS/WTC; bitpos: [28]; default: 0;
 *  1: SPI1 write access error. 0: No write access error. It is cleared by when
 *  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_LD    (BIT(28))
#define SPI_MEM_C_PMS_LD_M  (SPI_MEM_C_PMS_LD_V << SPI_MEM_C_PMS_LD_S)
#define SPI_MEM_C_PMS_LD_V  0x00000001U
#define SPI_MEM_C_PMS_LD_S  28
/** SPI_MEM_C_PMS_ST : R/SS/WTC; bitpos: [29]; default: 0;
 *  1: SPI1 read access error. 0: No read access error. It is cleared by when
 *  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_ST    (BIT(29))
#define SPI_MEM_C_PMS_ST_M  (SPI_MEM_C_PMS_ST_V << SPI_MEM_C_PMS_ST_S)
#define SPI_MEM_C_PMS_ST_V  0x00000001U
#define SPI_MEM_C_PMS_ST_S  29
/** SPI_MEM_C_PMS_MULTI_HIT : R/SS/WTC; bitpos: [30]; default: 0;
 *  1: SPI1 access is rejected because of address miss. 0: No address miss error. It is
 *  cleared by when  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_MULTI_HIT    (BIT(30))
#define SPI_MEM_C_PMS_MULTI_HIT_M  (SPI_MEM_C_PMS_MULTI_HIT_V << SPI_MEM_C_PMS_MULTI_HIT_S)
#define SPI_MEM_C_PMS_MULTI_HIT_V  0x00000001U
#define SPI_MEM_C_PMS_MULTI_HIT_S  30
/** SPI_MEM_C_PMS_IVD : R/SS/WTC; bitpos: [31]; default: 0;
 *  1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit
 *  error. It is cleared by when  SPI_MEM_C_PMS_REJECT_INT_CLR bit is set.
 */
#define SPI_MEM_C_PMS_IVD    (BIT(31))
#define SPI_MEM_C_PMS_IVD_M  (SPI_MEM_C_PMS_IVD_V << SPI_MEM_C_PMS_IVD_S)
#define SPI_MEM_C_PMS_IVD_V  0x00000001U
#define SPI_MEM_C_PMS_IVD_S  31

