espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_c_reg.h
/** SPI_MEM_C_ECC_CTRL_REG register
 *  MSPI ECC control register
 */
#define SPI_MEM_C_ECC_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x168)
/** SPI_MEM_C_ECC_ERR_CNT : HRO; bitpos: [10:5]; default: 0;
 *  This bits show the error times of MSPI ECC read. It is cleared by when
 *  SPI_MEM_C_ECC_ERR_INT_CLR bit is set.
 */
#define SPI_MEM_C_ECC_ERR_CNT    0x0000003FU
#define SPI_MEM_C_ECC_ERR_CNT_M  (SPI_MEM_C_ECC_ERR_CNT_V << SPI_MEM_C_ECC_ERR_CNT_S)
#define SPI_MEM_C_ECC_ERR_CNT_V  0x0000003FU
#define SPI_MEM_C_ECC_ERR_CNT_S  5
/** SPI_MEM_C_FMEM__ECC_ERR_INT_NUM : HRO; bitpos: [16:11]; default: 10;
 *  Set the error times of MSPI ECC read to generate MSPI SPI_MEM_C_ECC_ERR_INT
 *  interrupt.
 */
#define SPI_MEM_C_FMEM__ECC_ERR_INT_NUM    0x0000003FU
#define SPI_MEM_C_FMEM__ECC_ERR_INT_NUM_M  (SPI_MEM_C_FMEM__ECC_ERR_INT_NUM_V << SPI_MEM_C_FMEM__ECC_ERR_INT_NUM_S)
#define SPI_MEM_C_FMEM__ECC_ERR_INT_NUM_V  0x0000003FU
#define SPI_MEM_C_FMEM__ECC_ERR_INT_NUM_S  11
/** SPI_MEM_C_FMEM__ECC_ERR_INT_EN : HRO; bitpos: [17]; default: 0;
 *  Set this bit to calculate the error times of MSPI ECC read when accesses to flash.
 */
#define SPI_MEM_C_FMEM__ECC_ERR_INT_EN    (BIT(17))
#define SPI_MEM_C_FMEM__ECC_ERR_INT_EN_M  (SPI_MEM_C_FMEM__ECC_ERR_INT_EN_V << SPI_MEM_C_FMEM__ECC_ERR_INT_EN_S)
#define SPI_MEM_C_FMEM__ECC_ERR_INT_EN_V  0x00000001U
#define SPI_MEM_C_FMEM__ECC_ERR_INT_EN_S  17
/** SPI_MEM_C_FMEM__PAGE_SIZE : R/W; bitpos: [19:18]; default: 0;
 *  Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2:
 *  1024 bytes. 3: 2048 bytes.
 */
#define SPI_MEM_C_FMEM__PAGE_SIZE    0x00000003U
#define SPI_MEM_C_FMEM__PAGE_SIZE_M  (SPI_MEM_C_FMEM__PAGE_SIZE_V << SPI_MEM_C_FMEM__PAGE_SIZE_S)
#define SPI_MEM_C_FMEM__PAGE_SIZE_V  0x00000003U
#define SPI_MEM_C_FMEM__PAGE_SIZE_S  18
/** SPI_MEM_C_FMEM__ECC_ADDR_EN : HRO; bitpos: [20]; default: 0;
 *  Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the
 *  ECC region or non-ECC region of flash. If there is no ECC region in flash, this bit
 *  should be 0. Otherwise, this bit should be 1.
 */
#define SPI_MEM_C_FMEM__ECC_ADDR_EN    (BIT(20))
#define SPI_MEM_C_FMEM__ECC_ADDR_EN_M  (SPI_MEM_C_FMEM__ECC_ADDR_EN_V << SPI_MEM_C_FMEM__ECC_ADDR_EN_S)
#define SPI_MEM_C_FMEM__ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_C_FMEM__ECC_ADDR_EN_S  20
/** SPI_MEM_C_USR_ECC_ADDR_EN : HRO; bitpos: [21]; default: 0;
 *  Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer.
 */
#define SPI_MEM_C_USR_ECC_ADDR_EN    (BIT(21))
#define SPI_MEM_C_USR_ECC_ADDR_EN_M  (SPI_MEM_C_USR_ECC_ADDR_EN_V << SPI_MEM_C_USR_ECC_ADDR_EN_S)
#define SPI_MEM_C_USR_ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_C_USR_ECC_ADDR_EN_S  21
/** SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN : HRO; bitpos: [24]; default: 1;
 *  1: The error information in SPI_MEM_C_ECC_ERR_BITS and SPI_MEM_C_ECC_ERR_ADDR is
 *  updated when there is an ECC error. 0: SPI_MEM_C_ECC_ERR_BITS and
 *  SPI_MEM_C_ECC_ERR_ADDR record the first ECC error information.
 */
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN    (BIT(24))
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_M  (SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_V << SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_S)
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_V  0x00000001U
#define SPI_MEM_C_ECC_CONTINUE_RECORD_ERR_EN_S  24
/** SPI_MEM_C_ECC_ERR_BITS : HRO; bitpos: [31:25]; default: 0;
 *  Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding to
 *  byte 0 bit 0 to byte 15 bit 7)
 */
#define SPI_MEM_C_ECC_ERR_BITS    0x0000007FU
#define SPI_MEM_C_ECC_ERR_BITS_M  (SPI_MEM_C_ECC_ERR_BITS_V << SPI_MEM_C_ECC_ERR_BITS_S)
#define SPI_MEM_C_ECC_ERR_BITS_V  0x0000007FU
#define SPI_MEM_C_ECC_ERR_BITS_S  25

/** SPI_MEM_C_ECC_ERR_ADDR_REG register
 *  MSPI ECC error address register
 */
#define SPI_MEM_C_ECC_ERR_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x16c)
/** SPI_MEM_C_ECC_ERR_ADDR : HRO; bitpos: [26:0]; default: 0;
 *  This bits show the first MSPI ECC error address. It is cleared by when
 *  SPI_MEM_C_ECC_ERR_INT_CLR bit is set.
 */
#define SPI_MEM_C_ECC_ERR_ADDR    0x07FFFFFFU
#define SPI_MEM_C_ECC_ERR_ADDR_M  (SPI_MEM_C_ECC_ERR_ADDR_V << SPI_MEM_C_ECC_ERR_ADDR_S)
#define SPI_MEM_C_ECC_ERR_ADDR_V  0x07FFFFFFU
#define SPI_MEM_C_ECC_ERR_ADDR_S  0

/** SPI_MEM_C_AXI_ERR_ADDR_REG register
 *  SPI0 AXI request error address.
 */
#define SPI_MEM_C_AXI_ERR_ADDR_REG (DR_REG_FLASH_SPI0_BASE + 0x170)
/** SPI_MEM_C_AXI_ERR_ADDR : R/SS/WTC; bitpos: [26:0]; default: 0;
 *  This bits show the first AXI write/read invalid error or AXI write flash error
 *  address. It is cleared by when SPI_MEM_C_AXI_WADDR_ERR_INT_CLR,
 *  SPI_MEM_C_AXI_WR_FLASH_ERR_IN_CLR or SPI_MEM_C_AXI_RADDR_ERR_IN_CLR bit is set.
 */
#define SPI_MEM_C_AXI_ERR_ADDR    0x07FFFFFFU
#define SPI_MEM_C_AXI_ERR_ADDR_M  (SPI_MEM_C_AXI_ERR_ADDR_V << SPI_MEM_C_AXI_ERR_ADDR_S)
#define SPI_MEM_C_AXI_ERR_ADDR_V  0x07FFFFFFU
#define SPI_MEM_C_AXI_ERR_ADDR_S  0

/** SPI_MEM_C_SMEM_ECC_CTRL_REG register
 *  MSPI ECC control register
 */
#define SPI_MEM_C_SMEM_ECC_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x174)
/** SPI_MEM_C_SMEM_ECC_ERR_INT_EN : HRO; bitpos: [17]; default: 0;
 *  Set this bit to calculate the error times of MSPI ECC read when accesses to
 *  external RAM.
 */
#define SPI_MEM_C_SMEM_ECC_ERR_INT_EN    (BIT(17))
#define SPI_MEM_C_SMEM_ECC_ERR_INT_EN_M  (SPI_MEM_C_SMEM_ECC_ERR_INT_EN_V << SPI_MEM_C_SMEM_ECC_ERR_INT_EN_S)
#define SPI_MEM_C_SMEM_ECC_ERR_INT_EN_V  0x00000001U
#define SPI_MEM_C_SMEM_ECC_ERR_INT_EN_S  17
/** SPI_MEM_C_SMEM_PAGE_SIZE : HRO; bitpos: [19:18]; default: 2;
 *  Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 bytes.
 *  2: 1024 bytes. 3: 2048 bytes.
 */
#define SPI_MEM_C_SMEM_PAGE_SIZE    0x00000003U
#define SPI_MEM_C_SMEM_PAGE_SIZE_M  (SPI_MEM_C_SMEM_PAGE_SIZE_V << SPI_MEM_C_SMEM_PAGE_SIZE_S)
#define SPI_MEM_C_SMEM_PAGE_SIZE_V  0x00000003U
#define SPI_MEM_C_SMEM_PAGE_SIZE_S  18
/** SPI_MEM_C_SMEM_ECC_ADDR_EN : HRO; bitpos: [20]; default: 0;
 *  Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the
 *  ECC region or non-ECC region of external RAM. If there is no ECC region in external
 *  RAM, this bit should be 0. Otherwise, this bit should be 1.
 */
#define SPI_MEM_C_SMEM_ECC_ADDR_EN    (BIT(20))
#define SPI_MEM_C_SMEM_ECC_ADDR_EN_M  (SPI_MEM_C_SMEM_ECC_ADDR_EN_V << SPI_MEM_C_SMEM_ECC_ADDR_EN_S)
#define SPI_MEM_C_SMEM_ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_C_SMEM_ECC_ADDR_EN_S  20

/** SPI_MEM_C_SMEM_AXI_ADDR_CTRL_REG register
 *  SPI0 AXI address control register
 */
#define SPI_MEM_C_SMEM_AXI_ADDR_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x178)
/** SPI_MEM_C_ALL_FIFO_EMPTY : RO; bitpos: [26]; default: 1;
 *  The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers
 *  and SPI0 transfers are done. 0: Others.
 */
#define SPI_MEM_C_ALL_FIFO_EMPTY    (BIT(26))
#define SPI_MEM_C_ALL_FIFO_EMPTY_M  (SPI_MEM_C_ALL_FIFO_EMPTY_V << SPI_MEM_C_ALL_FIFO_EMPTY_S)
#define SPI_MEM_C_ALL_FIFO_EMPTY_V  0x00000001U
#define SPI_MEM_C_ALL_FIFO_EMPTY_S  26
/** SPI_MEM_C_RDATA_AFIFO_REMPTY : RO; bitpos: [27]; default: 1;
 *  1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending.
 */
#define SPI_MEM_C_RDATA_AFIFO_REMPTY    (BIT(27))
#define SPI_MEM_C_RDATA_AFIFO_REMPTY_M  (SPI_MEM_C_RDATA_AFIFO_REMPTY_V << SPI_MEM_C_RDATA_AFIFO_REMPTY_S)
#define SPI_MEM_C_RDATA_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_C_RDATA_AFIFO_REMPTY_S  27
/** SPI_MEM_C_RADDR_AFIFO_REMPTY : RO; bitpos: [28]; default: 1;
 *  1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending.
 */
#define SPI_MEM_C_RADDR_AFIFO_REMPTY    (BIT(28))
#define SPI_MEM_C_RADDR_AFIFO_REMPTY_M  (SPI_MEM_C_RADDR_AFIFO_REMPTY_V << SPI_MEM_C_RADDR_AFIFO_REMPTY_S)
#define SPI_MEM_C_RADDR_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_C_RADDR_AFIFO_REMPTY_S  28
/** SPI_MEM_C_WDATA_AFIFO_REMPTY : RO; bitpos: [29]; default: 1;
 *  1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending.
 */
#define SPI_MEM_C_WDATA_AFIFO_REMPTY    (BIT(29))
#define SPI_MEM_C_WDATA_AFIFO_REMPTY_M  (SPI_MEM_C_WDATA_AFIFO_REMPTY_V << SPI_MEM_C_WDATA_AFIFO_REMPTY_S)
#define SPI_MEM_C_WDATA_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_C_WDATA_AFIFO_REMPTY_S  29
/** SPI_MEM_C_WBLEN_AFIFO_REMPTY : RO; bitpos: [30]; default: 1;
 *  1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending.
 */
#define SPI_MEM_C_WBLEN_AFIFO_REMPTY    (BIT(30))
#define SPI_MEM_C_WBLEN_AFIFO_REMPTY_M  (SPI_MEM_C_WBLEN_AFIFO_REMPTY_V << SPI_MEM_C_WBLEN_AFIFO_REMPTY_S)
#define SPI_MEM_C_WBLEN_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_C_WBLEN_AFIFO_REMPTY_S  30
/** SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY : RO; bitpos: [31]; default: 1;
 *  This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO and
 *  RDATA_AFIFO are empty and spi0_mst_st is IDLE.
 */
#define SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY    (BIT(31))
#define SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY_M  (SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY_V << SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY_S)
#define SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY_V  0x00000001U
#define SPI_MEM_C_ALL_AXI_TRANS_AFIFO_EMPTY_S  31

/** SPI_MEM_C_AXI_ERR_RESP_EN_REG register
 *  SPI0 AXI error response enable register
 */
#define SPI_MEM_C_AXI_ERR_RESP_EN_REG (DR_REG_FLASH_SPI0_BASE + 0x17c)
/** SPI_MEM_C_AW_RESP_EN_MMU_VLD : HRO; bitpos: [0]; default: 0;
 *  Set this bit  to enable AXI response function for mmu valid err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD    (BIT(0))
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD_M  (SPI_MEM_C_AW_RESP_EN_MMU_VLD_V << SPI_MEM_C_AW_RESP_EN_MMU_VLD_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_VLD_S  0
/** SPI_MEM_C_AW_RESP_EN_MMU_GID : HRO; bitpos: [1]; default: 0;
 *  Set this bit  to enable AXI response function for mmu gid err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_GID    (BIT(1))
#define SPI_MEM_C_AW_RESP_EN_MMU_GID_M  (SPI_MEM_C_AW_RESP_EN_MMU_GID_V << SPI_MEM_C_AW_RESP_EN_MMU_GID_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_GID_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_GID_S  1
/** SPI_MEM_C_AW_RESP_EN_AXI_SIZE : HRO; bitpos: [2]; default: 0;
 *  Set this bit  to enable AXI response function for axi size err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE    (BIT(2))
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE_M  (SPI_MEM_C_AW_RESP_EN_AXI_SIZE_V << SPI_MEM_C_AW_RESP_EN_AXI_SIZE_S)
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_AXI_SIZE_S  2
/** SPI_MEM_C_AW_RESP_EN_AXI_FLASH : HRO; bitpos: [3]; default: 0;
 *  Set this bit  to enable AXI response function for axi flash err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH    (BIT(3))
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH_M  (SPI_MEM_C_AW_RESP_EN_AXI_FLASH_V << SPI_MEM_C_AW_RESP_EN_AXI_FLASH_S)
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_AXI_FLASH_S  3
/** SPI_MEM_C_AW_RESP_EN_MMU_ECC : HRO; bitpos: [4]; default: 0;
 *  Set this bit  to enable AXI response function for mmu ecc err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC    (BIT(4))
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC_M  (SPI_MEM_C_AW_RESP_EN_MMU_ECC_V << SPI_MEM_C_AW_RESP_EN_MMU_ECC_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_ECC_S  4
/** SPI_MEM_C_AW_RESP_EN_MMU_SENS : HRO; bitpos: [5]; default: 0;
 *  Set this bit  to enable AXI response function for mmu sens in err axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS    (BIT(5))
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS_M  (SPI_MEM_C_AW_RESP_EN_MMU_SENS_V << SPI_MEM_C_AW_RESP_EN_MMU_SENS_S)
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_MMU_SENS_S  5
/** SPI_MEM_C_AW_RESP_EN_AXI_WSTRB : HRO; bitpos: [6]; default: 0;
 *  Set this bit  to enable AXI response function for axi wstrb err in axi write trans.
 */
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB    (BIT(6))
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_M  (SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_V << SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_S)
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_V  0x00000001U
#define SPI_MEM_C_AW_RESP_EN_AXI_WSTRB_S  6
/** SPI_MEM_C_AR_RESP_EN_MMU_VLD : R/W; bitpos: [7]; default: 0;
 *  Set this bit  to enable AXI response function for mmu valid err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD    (BIT(7))
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD_M  (SPI_MEM_C_AR_RESP_EN_MMU_VLD_V << SPI_MEM_C_AR_RESP_EN_MMU_VLD_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_VLD_S  7
/** SPI_MEM_C_AR_RESP_EN_MMU_GID : R/W; bitpos: [8]; default: 0;
 *  Set this bit  to enable AXI response function for mmu gid err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_GID    (BIT(8))
#define SPI_MEM_C_AR_RESP_EN_MMU_GID_M  (SPI_MEM_C_AR_RESP_EN_MMU_GID_V << SPI_MEM_C_AR_RESP_EN_MMU_GID_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_GID_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_GID_S  8
/** SPI_MEM_C_AR_RESP_EN_MMU_ECC : R/W; bitpos: [9]; default: 0;
 *  Set this bit  to enable AXI response function for mmu ecc err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC    (BIT(9))
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC_M  (SPI_MEM_C_AR_RESP_EN_MMU_ECC_V << SPI_MEM_C_AR_RESP_EN_MMU_ECC_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_ECC_S  9
/** SPI_MEM_C_AR_RESP_EN_MMU_SENS : R/W; bitpos: [10]; default: 0;
 *  Set this bit  to enable AXI response function for mmu sensitive err in axi read
 *  trans.
 */
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS    (BIT(10))
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS_M  (SPI_MEM_C_AR_RESP_EN_MMU_SENS_V << SPI_MEM_C_AR_RESP_EN_MMU_SENS_S)
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_MMU_SENS_S  10
/** SPI_MEM_C_AR_RESP_EN_AXI_SIZE : R/W; bitpos: [11]; default: 0;
 *  Set this bit  to enable AXI response function for axi size err in axi read trans.
 */
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE    (BIT(11))
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE_M  (SPI_MEM_C_AR_RESP_EN_AXI_SIZE_V << SPI_MEM_C_AR_RESP_EN_AXI_SIZE_S)
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE_V  0x00000001U
#define SPI_MEM_C_AR_RESP_EN_AXI_SIZE_S  11

/** SPI_MEM_C_TIMING_CALI_REG register
 *  SPI0 flash timing calibration register
 */
#define SPI_MEM_C_TIMING_CALI_REG (DR_REG_FLASH_SPI0_BASE + 0x180)
/** SPI_MEM_C_TIMING_CLK_ENA : R/W; bitpos: [0]; default: 1;
 *  The bit is used to enable timing adjust clock for all reading operations.
 */
#define SPI_MEM_C_TIMING_CLK_ENA    (BIT(0))
#define SPI_MEM_C_TIMING_CLK_ENA_M  (SPI_MEM_C_TIMING_CLK_ENA_V << SPI_MEM_C_TIMING_CLK_ENA_S)
#define SPI_MEM_C_TIMING_CLK_ENA_V  0x00000001U
#define SPI_MEM_C_TIMING_CLK_ENA_S  0
/** SPI_MEM_C_TIMING_CALI : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable timing auto-calibration for all reading operations.
 */
#define SPI_MEM_C_TIMING_CALI    (BIT(1))
#define SPI_MEM_C_TIMING_CALI_M  (SPI_MEM_C_TIMING_CALI_V << SPI_MEM_C_TIMING_CALI_S)
#define SPI_MEM_C_TIMING_CALI_V  0x00000001U
#define SPI_MEM_C_TIMING_CALI_S  1
/** SPI_MEM_C_EXTRA_DUMMY_CYCLELEN : R/W; bitpos: [4:2]; default: 0;
 *  add extra dummy spi clock cycle length for spi clock calibration.
 */
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN    0x00000007U
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_M  (SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_V << SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_S)
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_V  0x00000007U
#define SPI_MEM_C_EXTRA_DUMMY_CYCLELEN_S  2
/** SPI_MEM_C_DLL_TIMING_CALI : HRO; bitpos: [5]; default: 0;
 *  Set this bit to enable DLL for timing calibration in DDR mode when accessed to
 *  flash.
 */
#define SPI_MEM_C_DLL_TIMING_CALI    (BIT(5))
#define SPI_MEM_C_DLL_TIMING_CALI_M  (SPI_MEM_C_DLL_TIMING_CALI_V << SPI_MEM_C_DLL_TIMING_CALI_S)
#define SPI_MEM_C_DLL_TIMING_CALI_V  0x00000001U
#define SPI_MEM_C_DLL_TIMING_CALI_S  5
/** SPI_MEM_C_TIMING_CALI_UPDATE : WT; bitpos: [6]; default: 0;
 *  Set this bit to update delay mode, delay num and extra dummy in MSPI.
 */
#define SPI_MEM_C_TIMING_CALI_UPDATE    (BIT(6))
#define SPI_MEM_C_TIMING_CALI_UPDATE_M  (SPI_MEM_C_TIMING_CALI_UPDATE_V << SPI_MEM_C_TIMING_CALI_UPDATE_S)
#define SPI_MEM_C_TIMING_CALI_UPDATE_V  0x00000001U
#define SPI_MEM_C_TIMING_CALI_UPDATE_S  6

/** SPI_MEM_C_DIN_MODE_REG register
 *  MSPI flash input timing delay mode control register
 */
#define SPI_MEM_C_DIN_MODE_REG (DR_REG_FLASH_SPI0_BASE + 0x184)
/** SPI_MEM_C_DIN0_MODE : R/W; bitpos: [2:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN0_MODE    0x00000007U
#define SPI_MEM_C_DIN0_MODE_M  (SPI_MEM_C_DIN0_MODE_V << SPI_MEM_C_DIN0_MODE_S)
#define SPI_MEM_C_DIN0_MODE_V  0x00000007U
#define SPI_MEM_C_DIN0_MODE_S  0
/** SPI_MEM_C_DIN1_MODE : R/W; bitpos: [5:3]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN1_MODE    0x00000007U
#define SPI_MEM_C_DIN1_MODE_M  (SPI_MEM_C_DIN1_MODE_V << SPI_MEM_C_DIN1_MODE_S)
#define SPI_MEM_C_DIN1_MODE_V  0x00000007U
#define SPI_MEM_C_DIN1_MODE_S  3
/** SPI_MEM_C_DIN2_MODE : R/W; bitpos: [8:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN2_MODE    0x00000007U
#define SPI_MEM_C_DIN2_MODE_M  (SPI_MEM_C_DIN2_MODE_V << SPI_MEM_C_DIN2_MODE_S)
#define SPI_MEM_C_DIN2_MODE_V  0x00000007U
#define SPI_MEM_C_DIN2_MODE_S  6
/** SPI_MEM_C_DIN3_MODE : R/W; bitpos: [11:9]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_C_DIN3_MODE    0x00000007U
#define SPI_MEM_C_DIN3_MODE_M  (SPI_MEM_C_DIN3_MODE_V << SPI_MEM_C_DIN3_MODE_S)
#define SPI_MEM_C_DIN3_MODE_V  0x00000007U
#define SPI_MEM_C_DIN3_MODE_S  9
/** SPI_MEM_C_DIN4_MODE : R/W; bitpos: [14:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN4_MODE    0x00000007U
#define SPI_MEM_C_DIN4_MODE_M  (SPI_MEM_C_DIN4_MODE_V << SPI_MEM_C_DIN4_MODE_S)
#define SPI_MEM_C_DIN4_MODE_V  0x00000007U
#define SPI_MEM_C_DIN4_MODE_S  12
/** SPI_MEM_C_DIN5_MODE : R/W; bitpos: [17:15]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN5_MODE    0x00000007U
#define SPI_MEM_C_DIN5_MODE_M  (SPI_MEM_C_DIN5_MODE_V << SPI_MEM_C_DIN5_MODE_S)
#define SPI_MEM_C_DIN5_MODE_V  0x00000007U
#define SPI_MEM_C_DIN5_MODE_S  15
/** SPI_MEM_C_DIN6_MODE : R/W; bitpos: [20:18]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN6_MODE    0x00000007U
#define SPI_MEM_C_DIN6_MODE_M  (SPI_MEM_C_DIN6_MODE_V << SPI_MEM_C_DIN6_MODE_S)
#define SPI_MEM_C_DIN6_MODE_V  0x00000007U
#define SPI_MEM_C_DIN6_MODE_S  18
/** SPI_MEM_C_DIN7_MODE : R/W; bitpos: [23:21]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DIN7_MODE    0x00000007U
#define SPI_MEM_C_DIN7_MODE_M  (SPI_MEM_C_DIN7_MODE_V << SPI_MEM_C_DIN7_MODE_S)
#define SPI_MEM_C_DIN7_MODE_V  0x00000007U
#define SPI_MEM_C_DIN7_MODE_S  21
/** SPI_MEM_C_DINS_MODE : R/W; bitpos: [26:24]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_C_DINS_MODE    0x00000007U
#define SPI_MEM_C_DINS_MODE_M  (SPI_MEM_C_DINS_MODE_V << SPI_MEM_C_DINS_MODE_S)
#define SPI_MEM_C_DINS_MODE_V  0x00000007U
#define SPI_MEM_C_DINS_MODE_S  24

