espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_c_reg.h
/** SPI_MEM_C_SMEM_DOUT_MODE_REG register
 *  MSPI external RAM output timing adjustment control register
 */
#define SPI_MEM_C_SMEM_DOUT_MODE_REG (DR_REG_FLASH_SPI0_BASE + 0x19c)
/** SPI_MEM_C_SMEM_DOUT0_MODE : HRO; bitpos: [0]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT0_MODE    (BIT(0))
#define SPI_MEM_C_SMEM_DOUT0_MODE_M  (SPI_MEM_C_SMEM_DOUT0_MODE_V << SPI_MEM_C_SMEM_DOUT0_MODE_S)
#define SPI_MEM_C_SMEM_DOUT0_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT0_MODE_S  0
/** SPI_MEM_C_SMEM_DOUT1_MODE : HRO; bitpos: [1]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT1_MODE    (BIT(1))
#define SPI_MEM_C_SMEM_DOUT1_MODE_M  (SPI_MEM_C_SMEM_DOUT1_MODE_V << SPI_MEM_C_SMEM_DOUT1_MODE_S)
#define SPI_MEM_C_SMEM_DOUT1_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT1_MODE_S  1
/** SPI_MEM_C_SMEM_DOUT2_MODE : HRO; bitpos: [2]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT2_MODE    (BIT(2))
#define SPI_MEM_C_SMEM_DOUT2_MODE_M  (SPI_MEM_C_SMEM_DOUT2_MODE_V << SPI_MEM_C_SMEM_DOUT2_MODE_S)
#define SPI_MEM_C_SMEM_DOUT2_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT2_MODE_S  2
/** SPI_MEM_C_SMEM_DOUT3_MODE : HRO; bitpos: [3]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT3_MODE    (BIT(3))
#define SPI_MEM_C_SMEM_DOUT3_MODE_M  (SPI_MEM_C_SMEM_DOUT3_MODE_V << SPI_MEM_C_SMEM_DOUT3_MODE_S)
#define SPI_MEM_C_SMEM_DOUT3_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT3_MODE_S  3
/** SPI_MEM_C_SMEM_DOUT4_MODE : HRO; bitpos: [4]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT4_MODE    (BIT(4))
#define SPI_MEM_C_SMEM_DOUT4_MODE_M  (SPI_MEM_C_SMEM_DOUT4_MODE_V << SPI_MEM_C_SMEM_DOUT4_MODE_S)
#define SPI_MEM_C_SMEM_DOUT4_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT4_MODE_S  4
/** SPI_MEM_C_SMEM_DOUT5_MODE : HRO; bitpos: [5]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT5_MODE    (BIT(5))
#define SPI_MEM_C_SMEM_DOUT5_MODE_M  (SPI_MEM_C_SMEM_DOUT5_MODE_V << SPI_MEM_C_SMEM_DOUT5_MODE_S)
#define SPI_MEM_C_SMEM_DOUT5_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT5_MODE_S  5
/** SPI_MEM_C_SMEM_DOUT6_MODE : HRO; bitpos: [6]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT6_MODE    (BIT(6))
#define SPI_MEM_C_SMEM_DOUT6_MODE_M  (SPI_MEM_C_SMEM_DOUT6_MODE_V << SPI_MEM_C_SMEM_DOUT6_MODE_S)
#define SPI_MEM_C_SMEM_DOUT6_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT6_MODE_S  6
/** SPI_MEM_C_SMEM_DOUT7_MODE : HRO; bitpos: [7]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUT7_MODE    (BIT(7))
#define SPI_MEM_C_SMEM_DOUT7_MODE_M  (SPI_MEM_C_SMEM_DOUT7_MODE_V << SPI_MEM_C_SMEM_DOUT7_MODE_S)
#define SPI_MEM_C_SMEM_DOUT7_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUT7_MODE_S  7
/** SPI_MEM_C_SMEM_DOUTS_MODE : HRO; bitpos: [8]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_C_SMEM_DOUTS_MODE    (BIT(8))
#define SPI_MEM_C_SMEM_DOUTS_MODE_M  (SPI_MEM_C_SMEM_DOUTS_MODE_V << SPI_MEM_C_SMEM_DOUTS_MODE_S)
#define SPI_MEM_C_SMEM_DOUTS_MODE_V  0x00000001U
#define SPI_MEM_C_SMEM_DOUTS_MODE_S  8

/** SPI_MEM_C_SMEM_AC_REG register
 *  MSPI external RAM ECC and SPI CS timing control register
 */
#define SPI_MEM_C_SMEM_AC_REG (DR_REG_FLASH_SPI0_BASE + 0x1a0)
/** SPI_MEM_C_SMEM_CS_SETUP : HRO; bitpos: [0]; default: 0;
 *  For SPI0 and SPI1, spi cs is enable when spi is in prepare phase. 1: enable 0:
 *  disable.
 */
#define SPI_MEM_C_SMEM_CS_SETUP    (BIT(0))
#define SPI_MEM_C_SMEM_CS_SETUP_M  (SPI_MEM_C_SMEM_CS_SETUP_V << SPI_MEM_C_SMEM_CS_SETUP_S)
#define SPI_MEM_C_SMEM_CS_SETUP_V  0x00000001U
#define SPI_MEM_C_SMEM_CS_SETUP_S  0
/** SPI_MEM_C_SMEM_CS_HOLD : HRO; bitpos: [1]; default: 0;
 *  For SPI0 and SPI1, spi cs keep low when spi is in done phase. 1: enable 0: disable.
 */
#define SPI_MEM_C_SMEM_CS_HOLD    (BIT(1))
#define SPI_MEM_C_SMEM_CS_HOLD_M  (SPI_MEM_C_SMEM_CS_HOLD_V << SPI_MEM_C_SMEM_CS_HOLD_S)
#define SPI_MEM_C_SMEM_CS_HOLD_V  0x00000001U
#define SPI_MEM_C_SMEM_CS_HOLD_S  1
/** SPI_MEM_C_SMEM_CS_SETUP_TIME : HRO; bitpos: [6:2]; default: 1;
 *  For spi0, (cycles-1) of prepare phase by spi clock this bits are combined with
 *  spi_mem_cs_setup bit.
 */
#define SPI_MEM_C_SMEM_CS_SETUP_TIME    0x0000001FU
#define SPI_MEM_C_SMEM_CS_SETUP_TIME_M  (SPI_MEM_C_SMEM_CS_SETUP_TIME_V << SPI_MEM_C_SMEM_CS_SETUP_TIME_S)
#define SPI_MEM_C_SMEM_CS_SETUP_TIME_V  0x0000001FU
#define SPI_MEM_C_SMEM_CS_SETUP_TIME_S  2
/** SPI_MEM_C_SMEM_CS_HOLD_TIME : HRO; bitpos: [11:7]; default: 1;
 *  For SPI0 and SPI1, spi cs signal is delayed to inactive by spi clock this bits are
 *  combined with spi_mem_cs_hold bit.
 */
#define SPI_MEM_C_SMEM_CS_HOLD_TIME    0x0000001FU
#define SPI_MEM_C_SMEM_CS_HOLD_TIME_M  (SPI_MEM_C_SMEM_CS_HOLD_TIME_V << SPI_MEM_C_SMEM_CS_HOLD_TIME_S)
#define SPI_MEM_C_SMEM_CS_HOLD_TIME_V  0x0000001FU
#define SPI_MEM_C_SMEM_CS_HOLD_TIME_S  7
/** SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME : HRO; bitpos: [14:12]; default: 3;
 *  SPI_MEM_C_SMEM_CS_HOLD_TIME + SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME is the SPI0 and SPI1
 *  CS hold cycles in ECC mode when accessed external RAM.
 */
#define SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME    0x00000007U
#define SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME_M  (SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME_V << SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME_S)
#define SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME_V  0x00000007U
#define SPI_MEM_C_SMEM_ECC_CS_HOLD_TIME_S  12
/** SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER : HRO; bitpos: [15]; default: 1;
 *  1: SPI0 skips page corner when accesses external RAM. 0: Not skip page corner when
 *  accesses external RAM.
 */
#define SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER    (BIT(15))
#define SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER_M  (SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER_V << SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER_S)
#define SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER_V  0x00000001U
#define SPI_MEM_C_SMEM_ECC_SKIP_PAGE_CORNER_S  15
/** SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN : HRO; bitpos: [16]; default: 0;
 *  Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode when
 *  accesses external RAM.
 */
#define SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN    (BIT(16))
#define SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN_M  (SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN_V << SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN_S)
#define SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN_V  0x00000001U
#define SPI_MEM_C_SMEM_ECC_16TO18_BYTE_EN_S  16
/** SPI_MEM_C_SMEM_CS_HOLD_DELAY : HRO; bitpos: [30:25]; default: 0;
 *  These bits are used to set the minimum CS high time tSHSL between SPI burst
 *  transfer when accesses to external RAM. tSHSL is (SPI_MEM_C_SMEM_CS_HOLD_DELAY[5:0]
 *  + 1) MSPI core clock cycles.
 */
#define SPI_MEM_C_SMEM_CS_HOLD_DELAY    0x0000003FU
#define SPI_MEM_C_SMEM_CS_HOLD_DELAY_M  (SPI_MEM_C_SMEM_CS_HOLD_DELAY_V << SPI_MEM_C_SMEM_CS_HOLD_DELAY_S)
#define SPI_MEM_C_SMEM_CS_HOLD_DELAY_V  0x0000003FU
#define SPI_MEM_C_SMEM_CS_HOLD_DELAY_S  25
/** SPI_MEM_C_SMEM_SPLIT_TRANS_EN : HRO; bitpos: [31]; default: 1;
 *  Set this bit to enable SPI0 split one AXI accesses EXT_RAM transfer into two SPI
 *  transfers when one transfer will cross flash/EXT_RAM page corner, valid no matter
 *  whether there is an ECC region or not.
 */
#define SPI_MEM_C_SMEM_SPLIT_TRANS_EN    (BIT(31))
#define SPI_MEM_C_SMEM_SPLIT_TRANS_EN_M  (SPI_MEM_C_SMEM_SPLIT_TRANS_EN_V << SPI_MEM_C_SMEM_SPLIT_TRANS_EN_S)
#define SPI_MEM_C_SMEM_SPLIT_TRANS_EN_V  0x00000001U
#define SPI_MEM_C_SMEM_SPLIT_TRANS_EN_S  31

/** SPI_MEM_C_CLOCK_GATE_REG register
 *  SPI0 clock gate register
 */
#define SPI_MEM_C_CLOCK_GATE_REG (DR_REG_FLASH_SPI0_BASE + 0x200)
/** SPI_MEM_C_CLK : R/W; bitpos: [0]; default: 1;
 *  Register clock gate enable signal. 1: Enable. 0: Disable.
 */
#define SPI_MEM_C_CLK    (BIT(0))
#define SPI_MEM_C_CLK_M  (SPI_MEM_C_CLK_V << SPI_MEM_C_CLK_S)
#define SPI_MEM_C_CLK_V  0x00000001U
#define SPI_MEM_C_CLK_S  0

/** SPI_MEM_C_XTS_PLAIN_BASE_REG register
 *  The base address of the memory that stores plaintext in Manual Encryption
 */
#define SPI_MEM_C_XTS_PLAIN_BASE_REG (DR_REG_FLASH_SPI0_BASE + 0x300)
/** SPI_MEM_C_XTS_PLAIN : R/W; bitpos: [31:0]; default: 0;
 *  This field is only used to generate include file in c case. This field is useless.
 *  Please do not use this field.
 */
#define SPI_MEM_C_XTS_PLAIN    0xFFFFFFFFU
#define SPI_MEM_C_XTS_PLAIN_M  (SPI_MEM_C_XTS_PLAIN_V << SPI_MEM_C_XTS_PLAIN_S)
#define SPI_MEM_C_XTS_PLAIN_V  0xFFFFFFFFU
#define SPI_MEM_C_XTS_PLAIN_S  0

/** SPI_MEM_C_XTS_LINESIZE_REG register
 *  Manual Encryption Line-Size register
 */
#define SPI_MEM_C_XTS_LINESIZE_REG (DR_REG_FLASH_SPI0_BASE + 0x340)
/** SPI_MEM_C_XTS_LINESIZE : R/W; bitpos: [1:0]; default: 0;
 *  This bits stores the line-size parameter which will be used in manual encryption
 *  calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1:
 *  32-bytes, 2: 64-bytes, 3:reserved.
 */
#define SPI_MEM_C_XTS_LINESIZE    0x00000003U
#define SPI_MEM_C_XTS_LINESIZE_M  (SPI_MEM_C_XTS_LINESIZE_V << SPI_MEM_C_XTS_LINESIZE_S)
#define SPI_MEM_C_XTS_LINESIZE_V  0x00000003U
#define SPI_MEM_C_XTS_LINESIZE_S  0

/** SPI_MEM_C_XTS_DESTINATION_REG register
 *  Manual Encryption destination register
 */
#define SPI_MEM_C_XTS_DESTINATION_REG (DR_REG_FLASH_SPI0_BASE + 0x344)
/** SPI_MEM_C_XTS_DESTINATION : R/W; bitpos: [0]; default: 0;
 *  This bit stores the destination parameter which will be used in manual encryption
 *  calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.
 */
#define SPI_MEM_C_XTS_DESTINATION    (BIT(0))
#define SPI_MEM_C_XTS_DESTINATION_M  (SPI_MEM_C_XTS_DESTINATION_V << SPI_MEM_C_XTS_DESTINATION_S)
#define SPI_MEM_C_XTS_DESTINATION_V  0x00000001U
#define SPI_MEM_C_XTS_DESTINATION_S  0

/** SPI_MEM_C_XTS_PHYSICAL_ADDRESS_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_C_XTS_PHYSICAL_ADDRESS_REG (DR_REG_FLASH_SPI0_BASE + 0x348)
/** SPI_MEM_C_XTS_PHYSICAL_ADDRESS : R/W; bitpos: [29:0]; default: 0;
 *  This bits stores the physical-address parameter which will be used in manual
 *  encryption calculation. This value should aligned with byte number decided by
 *  line-size parameter.
 */
#define SPI_MEM_C_XTS_PHYSICAL_ADDRESS    0x3FFFFFFFU
#define SPI_MEM_C_XTS_PHYSICAL_ADDRESS_M  (SPI_MEM_C_XTS_PHYSICAL_ADDRESS_V << SPI_MEM_C_XTS_PHYSICAL_ADDRESS_S)
#define SPI_MEM_C_XTS_PHYSICAL_ADDRESS_V  0x3FFFFFFFU
#define SPI_MEM_C_XTS_PHYSICAL_ADDRESS_S  0

/** SPI_MEM_C_XTS_TRIGGER_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_C_XTS_TRIGGER_REG (DR_REG_FLASH_SPI0_BASE + 0x34c)
/** SPI_MEM_C_XTS_TRIGGER : WT; bitpos: [0]; default: 0;
 *  Set this bit to trigger the process of manual encryption calculation. This action
 *  should only be asserted when manual encryption status is 0. After this action,
 *  manual encryption status becomes 1. After calculation is done, manual encryption
 *  status becomes 2.
 */
#define SPI_XTS_TRIGGER    (BIT(0))
#define SPI_XTS_TRIGGER_M  (SPI_XTS_TRIGGER_V << SPI_XTS_TRIGGER_S)
#define SPI_XTS_TRIGGER_V  0x00000001U
#define SPI_XTS_TRIGGER_S  0

/** SPI_MEM_C_XTS_RELEASE_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_C_XTS_RELEASE_REG (DR_REG_FLASH_SPI0_BASE + 0x350)
/** SPI_MEM_C_XTS_RELEASE : WT; bitpos: [0]; default: 0;
 *  Set this bit to release encrypted result to mspi. This action should only be
 *  asserted when manual encryption status is 2. After this action, manual encryption
 *  status will become 3.
 */
#define SPI_MEM_C_XTS_RELEASE    (BIT(0))
#define SPI_MEM_C_XTS_RELEASE_M  (SPI_MEM_C_XTS_RELEASE_V << SPI_MEM_C_XTS_RELEASE_S)
#define SPI_MEM_C_XTS_RELEASE_V  0x00000001U
#define SPI_MEM_C_XTS_RELEASE_S  0

/** SPI_MEM_C_XTS_DESTROY_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_C_XTS_DESTROY_REG (DR_REG_FLASH_SPI0_BASE + 0x354)
/** SPI_MEM_C_XTS_DESTROY : WT; bitpos: [0]; default: 0;
 *  Set this bit to destroy encrypted result. This action should be asserted only when
 *  manual encryption status is 3. After this action, manual encryption status will
 *  become 0.
 */
#define SPI_MEM_C_XTS_DESTROY    (BIT(0))
#define SPI_MEM_C_XTS_DESTROY_M  (SPI_MEM_C_XTS_DESTROY_V << SPI_MEM_C_XTS_DESTROY_S)
#define SPI_MEM_C_XTS_DESTROY_V  0x00000001U
#define SPI_MEM_C_XTS_DESTROY_S  0

/** SPI_MEM_C_XTS_STATE_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_C_XTS_STATE_REG (DR_REG_FLASH_SPI0_BASE + 0x358)
/** SPI_MEM_C_XTS_STATE : RO; bitpos: [1:0]; default: 0;
 *  This bits stores the status of manual encryption. 0: idle, 1: busy of encryption
 *  calculation, 2: encryption calculation is done but the encrypted result is
 *  invisible to mspi, 3: the encrypted result is visible to mspi.
 */
#define SPI_MEM_C_XTS_STATE    0x00000003U
#define SPI_MEM_C_XTS_STATE_M  (SPI_MEM_C_XTS_STATE_V << SPI_MEM_C_XTS_STATE_S)
#define SPI_MEM_C_XTS_STATE_V  0x00000003U
#define SPI_MEM_C_XTS_STATE_S  0

/** SPI_MEM_C_XTS_DATE_REG register
 *  Manual Encryption version register
 */
#define SPI_MEM_C_XTS_DATE_REG (DR_REG_FLASH_SPI0_BASE + 0x35c)
/** SPI_MEM_C_XTS_DATE : R/W; bitpos: [29:0]; default: 539035911;
 *  This bits stores the last modified-time of manual encryption feature.
 */
#define SPI_MEM_C_XTS_DATE    0x3FFFFFFFU
#define SPI_MEM_C_XTS_DATE_M  (SPI_MEM_C_XTS_DATE_V << SPI_MEM_C_XTS_DATE_S)
#define SPI_MEM_C_XTS_DATE_V  0x3FFFFFFFU
#define SPI_MEM_C_XTS_DATE_S  0

