espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_c_reg.h
/** SPI_MEM_C_MMU_ITEM_CONTENT_REG register
 *  MSPI-MMU item content register
 */
#define SPI_MEM_C_MMU_ITEM_CONTENT_REG (DR_REG_FLASH_SPI0_BASE + 0x37c)
/** SPI_MEM_C_MMU_ITEM_CONTENT : R/W; bitpos: [31:0]; default: 892;
 *  MSPI-MMU item content
 */
#define SPI_MEM_C_MMU_ITEM_CONTENT    0xFFFFFFFFU
#define SPI_MEM_C_MMU_ITEM_CONTENT_M  (SPI_MEM_C_MMU_ITEM_CONTENT_V << SPI_MEM_C_MMU_ITEM_CONTENT_S)
#define SPI_MEM_C_MMU_ITEM_CONTENT_V  0xFFFFFFFFU
#define SPI_MEM_C_MMU_ITEM_CONTENT_S  0

/** SPI_MEM_C_MMU_ITEM_INDEX_REG register
 *  MSPI-MMU item index register
 */
#define SPI_MEM_C_MMU_ITEM_INDEX_REG (DR_REG_FLASH_SPI0_BASE + 0x380)
/** SPI_MEM_C_MMU_ITEM_INDEX : R/W; bitpos: [31:0]; default: 0;
 *  MSPI-MMU item index
 */
#define SPI_MEM_C_MMU_ITEM_INDEX    0xFFFFFFFFU
#define SPI_MEM_C_MMU_ITEM_INDEX_M  (SPI_MEM_C_MMU_ITEM_INDEX_V << SPI_MEM_C_MMU_ITEM_INDEX_S)
#define SPI_MEM_C_MMU_ITEM_INDEX_V  0xFFFFFFFFU
#define SPI_MEM_C_MMU_ITEM_INDEX_S  0

/** SPI_MEM_C_MMU_POWER_CTRL_REG register
 *  MSPI MMU power control register
 */
#define SPI_MEM_C_MMU_POWER_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x384)
/** SPI_MEM_C_MMU_MEM_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable mmu-memory clock force on
 */
#define SPI_MEM_C_MMU_MEM_FORCE_ON    (BIT(0))
#define SPI_MEM_C_MMU_MEM_FORCE_ON_M  (SPI_MEM_C_MMU_MEM_FORCE_ON_V << SPI_MEM_C_MMU_MEM_FORCE_ON_S)
#define SPI_MEM_C_MMU_MEM_FORCE_ON_V  0x00000001U
#define SPI_MEM_C_MMU_MEM_FORCE_ON_S  0
/** SPI_MEM_C_MMU_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force mmu-memory powerdown
 */
#define SPI_MEM_C_MMU_MEM_FORCE_PD    (BIT(1))
#define SPI_MEM_C_MMU_MEM_FORCE_PD_M  (SPI_MEM_C_MMU_MEM_FORCE_PD_V << SPI_MEM_C_MMU_MEM_FORCE_PD_S)
#define SPI_MEM_C_MMU_MEM_FORCE_PD_V  0x00000001U
#define SPI_MEM_C_MMU_MEM_FORCE_PD_S  1
/** SPI_MEM_C_MMU_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 *  Set this bit to force mmu-memory powerup, in this case, the power should also be
 *  controlled by rtc.
 */
#define SPI_MEM_C_MMU_MEM_FORCE_PU    (BIT(2))
#define SPI_MEM_C_MMU_MEM_FORCE_PU_M  (SPI_MEM_C_MMU_MEM_FORCE_PU_V << SPI_MEM_C_MMU_MEM_FORCE_PU_S)
#define SPI_MEM_C_MMU_MEM_FORCE_PU_V  0x00000001U
#define SPI_MEM_C_MMU_MEM_FORCE_PU_S  2
/** SPI_MEM_C_MMU_PAGE_SIZE : R/W; bitpos: [4:3]; default: 0;
 *  0: Max page size , 1: Max page size/2 , 2: Max page size/4, 3: Max page size/8
 */
#define SPI_MEM_C_MMU_PAGE_SIZE    0x00000003U
#define SPI_MEM_C_MMU_PAGE_SIZE_M  (SPI_MEM_C_MMU_PAGE_SIZE_V << SPI_MEM_C_MMU_PAGE_SIZE_S)
#define SPI_MEM_C_MMU_PAGE_SIZE_V  0x00000003U
#define SPI_MEM_C_MMU_PAGE_SIZE_S  3
/** SPI_MEM_C_AUX_CTRL : HRO; bitpos: [29:16]; default: 4896;
 *  MMU PSRAM aux control register
 */
#define SPI_MEM_C_AUX_CTRL    0x00003FFFU
#define SPI_MEM_C_AUX_CTRL_M  (SPI_MEM_C_AUX_CTRL_V << SPI_MEM_C_AUX_CTRL_S)
#define SPI_MEM_C_AUX_CTRL_V  0x00003FFFU
#define SPI_MEM_C_AUX_CTRL_S  16
/** SPI_MEM_C_RDN_ENA : HRO; bitpos: [30]; default: 0;
 *  ECO register enable bit
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_RDN_ENA    (BIT(30))
#define SPI_MEM_C_RDN_ENA_M  (SPI_MEM_C_RDN_ENA_V << SPI_MEM_C_RDN_ENA_S)
#define SPI_MEM_C_RDN_ENA_V  0x00000001U
#define SPI_MEM_C_RDN_ENA_S  30
/** SPI_MEM_C_RDN_RESULT : RO; bitpos: [31]; default: 0;
 *  MSPI module clock domain and AXI clock domain ECO register result register
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_RDN_RESULT    (BIT(31))
#define SPI_MEM_C_RDN_RESULT_M  (SPI_MEM_C_RDN_RESULT_V << SPI_MEM_C_RDN_RESULT_S)
#define SPI_MEM_C_RDN_RESULT_V  0x00000001U
#define SPI_MEM_C_RDN_RESULT_S  31

/** SPI_MEM_C_DPA_CTRL_REG register
 *  SPI memory cryption DPA register
 */
#define SPI_MEM_C_DPA_CTRL_REG (DR_REG_FLASH_SPI0_BASE + 0x388)
/** SPI_MEM_C_CRYPT_SECURITY_LEVEL : R/W; bitpos: [2:0]; default: 7;
 *  Set the security level of spi mem cryption. 0: Shut off cryption DPA function. 1-7:
 *  The bigger the number is, the more secure the cryption is. (Note that the
 *  performance of cryption will decrease together with this number increasing)
 */
#define SPI_MEM_C_CRYPT_SECURITY_LEVEL    0x00000007U
#define SPI_MEM_C_CRYPT_SECURITY_LEVEL_M  (SPI_MEM_C_CRYPT_SECURITY_LEVEL_V << SPI_MEM_C_CRYPT_SECURITY_LEVEL_S)
#define SPI_MEM_C_CRYPT_SECURITY_LEVEL_V  0x00000007U
#define SPI_MEM_C_CRYPT_SECURITY_LEVEL_S  0
/** SPI_MEM_C_CRYPT_CALC_D_DPA_EN : R/W; bitpos: [3]; default: 1;
 *  Only available when SPI_MEM_C_CRYPT_SECURITY_LEVEL is not 0. 1: Enable DPA in the
 *  calculation that using key 1 or key 2. 0: Enable DPA only in the calculation that
 *  using key 1.
 */
#define SPI_MEM_C_CRYPT_CALC_D_DPA_EN    (BIT(3))
#define SPI_MEM_C_CRYPT_CALC_D_DPA_EN_M  (SPI_MEM_C_CRYPT_CALC_D_DPA_EN_V << SPI_MEM_C_CRYPT_CALC_D_DPA_EN_S)
#define SPI_MEM_C_CRYPT_CALC_D_DPA_EN_V  0x00000001U
#define SPI_MEM_C_CRYPT_CALC_D_DPA_EN_S  3
/** SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER : R/W; bitpos: [4]; default: 0;
 *  1: MSPI XTS DPA clock gate is controlled by SPI_MEM_C_CRYPT_CALC_D_DPA_EN and
 *  SPI_MEM_C_CRYPT_SECURITY_LEVEL. 0: Controlled by efuse bits.
 */
#define SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER    (BIT(4))
#define SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER_M  (SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER_V << SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER_S)
#define SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER_V  0x00000001U
#define SPI_MEM_C_CRYPT_DPA_SELECT_REGISTER_S  4

/** SPI_MEM_C_XTS_PSEUDO_ROUND_CONF_REG register
 *  SPI memory cryption PSEUDO register
 */
#define SPI_MEM_C_XTS_PSEUDO_ROUND_CONF_REG (DR_REG_FLASH_SPI0_BASE + 0x38c)
/** SPI_MEM_C_MODE_PSEUDO : R/W; bitpos: [1:0]; default: 0;
 *  Set the mode of pseudo. 2'b00: crypto without pseudo. 2'b01: state T with pseudo
 *  and state D without pseudo. 2'b10: state T with pseudo and state D with few pseudo.
 *  2'b11: crypto with pseudo.
 */
#define SPI_MEM_C_MODE_PSEUDO    0x00000003U
#define SPI_MEM_C_MODE_PSEUDO_M  (SPI_MEM_C_MODE_PSEUDO_V << SPI_MEM_C_MODE_PSEUDO_S)
#define SPI_MEM_C_MODE_PSEUDO_V  0x00000003U
#define SPI_MEM_C_MODE_PSEUDO_S  0
/** SPI_MEM_C_PSEUDO_RNG_CNT : R/W; bitpos: [4:2]; default: 7;
 *  xts aes peseudo function base round that must be performed.
 */
#define SPI_MEM_C_PSEUDO_RNG_CNT    0x00000007U
#define SPI_MEM_C_PSEUDO_RNG_CNT_M  (SPI_MEM_C_PSEUDO_RNG_CNT_V << SPI_MEM_C_PSEUDO_RNG_CNT_S)
#define SPI_MEM_C_PSEUDO_RNG_CNT_V  0x00000007U
#define SPI_MEM_C_PSEUDO_RNG_CNT_S  2
/** SPI_MEM_C_PSEUDO_BASE : R/W; bitpos: [8:5]; default: 2;
 *  xts aes peseudo function base round that must be performed.
 */
#define SPI_MEM_C_PSEUDO_BASE    0x0000000FU
#define SPI_MEM_C_PSEUDO_BASE_M  (SPI_MEM_C_PSEUDO_BASE_V << SPI_MEM_C_PSEUDO_BASE_S)
#define SPI_MEM_C_PSEUDO_BASE_V  0x0000000FU
#define SPI_MEM_C_PSEUDO_BASE_S  5
/** SPI_MEM_C_PSEUDO_INC : R/W; bitpos: [10:9]; default: 2;
 *  xts aes peseudo function increment round that will be performed randomly between 0 &
 *  2**(inc+1).
 */
#define SPI_MEM_C_PSEUDO_INC    0x00000003U
#define SPI_MEM_C_PSEUDO_INC_M  (SPI_MEM_C_PSEUDO_INC_V << SPI_MEM_C_PSEUDO_INC_S)
#define SPI_MEM_C_PSEUDO_INC_V  0x00000003U
#define SPI_MEM_C_PSEUDO_INC_S  9

/** SPI_MEM_C_REGISTERRND_ECO_HIGH_REG register
 *  MSPI ECO high register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_REGISTERRND_ECO_HIGH_REG (DR_REG_FLASH_SPI0_BASE + 0x3f0)
/** SPI_MEM_C_REGISTERRND_ECO_HIGH : RO; bitpos: [31:0]; default: 892;
 *  ECO high register
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_REGISTERRND_ECO_HIGH    0xFFFFFFFFU
#define SPI_MEM_C_REGISTERRND_ECO_HIGH_M  (SPI_MEM_C_REGISTERRND_ECO_HIGH_V << SPI_MEM_C_REGISTERRND_ECO_HIGH_S)
#define SPI_MEM_C_REGISTERRND_ECO_HIGH_V  0xFFFFFFFFU
#define SPI_MEM_C_REGISTERRND_ECO_HIGH_S  0

/** SPI_MEM_C_REGISTERRND_ECO_LOW_REG register
 *  MSPI ECO low register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_C_REGISTERRND_ECO_LOW_REG (DR_REG_FLASH_SPI0_BASE + 0x3f4)
/** SPI_MEM_C_REGISTERRND_ECO_LOW : RO; bitpos: [31:0]; default: 892;
 *  ECO low register
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_C_REGISTERRND_ECO_LOW    0xFFFFFFFFU
#define SPI_MEM_C_REGISTERRND_ECO_LOW_M  (SPI_MEM_C_REGISTERRND_ECO_LOW_V << SPI_MEM_C_REGISTERRND_ECO_LOW_S)
#define SPI_MEM_C_REGISTERRND_ECO_LOW_V  0xFFFFFFFFU
#define SPI_MEM_C_REGISTERRND_ECO_LOW_S  0

/** SPI_MEM_C_DATE_REG register
 *  SPI0 version control register
 */
#define SPI_MEM_C_DATE_REG (DR_REG_FLASH_SPI0_BASE + 0x3fc)
/** SPI_MEM_C_DATE : R/W; bitpos: [27:0]; default: 38805888;
 *  SPI0 register version.
 */
#define SPI_MEM_C_DATE    0x0FFFFFFFU
#define SPI_MEM_C_DATE_M  (SPI_MEM_C_DATE_V << SPI_MEM_C_DATE_S)
#define SPI_MEM_C_DATE_V  0x0FFFFFFFU
#define SPI_MEM_C_DATE_S  0

#ifdef __cplusplus
}
#endif
